[
  {
    "start": 969.25,
    "end": 1737.04,
    "text": [
      "[969.25-970.67] SPEAKER_02: Thank you very much.",
      "[971.73-978.08] SPEAKER_02: I think I first want to echo and perhaps be a little bit more direct about what Director Catlin said.",
      "[980.16-985.61] SPEAKER_02: We have bus routes in this system that don't qualify for the ADA service, but they're bus routes anyway.",
      "[986.67-989.72] SPEAKER_02: There are commuter routes and I",
      "[989.7-998.22] SPEAKER_02: would not vote personally for a change that would cut off the people who live within three quarters of a mile of those routes.",
      "[998.27-1004.69] SPEAKER_02: So at least for me, you guys want to get this through, you're going to need to change that because it's just a matter of basic equity.",
      "[1004.73-1006.29] SPEAKER_02: Otherwise, Peggy has like",
      "[1006.96-1010.69] SPEAKER_02: two places in our district that get service and that's just not reasonable.",
      "[1010.71-1013.84] SPEAKER_02: There are a lot of older folks that live up in those areas.",
      "[1014.82-1022.05] SPEAKER_02: I think the second issue that I have with what's being proposed is that the needs of",
      "[1022.67-1031.73] SPEAKER_02: you know, not call it rural, but mountainous Jefferson County when it comes to AOD are very different than the needs of central Denver.",
      "[1032.53-1042.49] SPEAKER_02: The trips I can get to most places that I need to go, you know, in terms of grocery stores, medical, et cetera, in a $15 Uber.",
      "[1042.47-1051.49] SPEAKER_02: You know, I don't think there's anywhere that you can get to for 15 bucks in Peggy's district or yours exactly.",
      "[1051.51-1053.02] SPEAKER_02: And so.",
      "[1053.64-1058.55] SPEAKER_02: But creating a system where the trip cap is 40 bucks doesn't work for me.",
      "[1058.66-1064.07] SPEAKER_02: Creating a trip cap where it's 15 bucks doesn't work for the people in her district.",
      "[1064.15-1075.81] SPEAKER_02: It strikes me that the right approach would be to have different levels of financial cap and different levels of trip cap to go along with them and let people pick.",
      "[1075.93-1077.87] SPEAKER_02: You want 60 trips at",
      "[1078.09-1079.21] SPEAKER_02: $15 per.",
      "[1079.67-1079.91] SPEAKER_02: Great.",
      "[1079.97-1082.54] SPEAKER_02: You want 50 trips at $20 per.",
      "[1082.68-1082.9] SPEAKER_02: Great.",
      "[1082.96-1085.91] SPEAKER_02: You want 40 trips at $30 per.",
      "[1086.27-1086.51] SPEAKER_02: Great.",
      "[1086.57-1087.67] SPEAKER_02: Depends on where you live.",
      "[1087.69-1089.63] SPEAKER_02: Depends on the types of trips you're going to be taking.",
      "[1089.69-1099.69] SPEAKER_02: But making people all fit into one size is either going to leave her people paying $20 for every single trip that they take.",
      "[1099.67-1108.77] SPEAKER_02: or it's going to put people in my district in a reduced number of rides because very few trips are going to cost $20 or $25.",
      "[1109.03-1111.08] SPEAKER_02: So those are my two pieces of feedback.",
      "[1111.1-1111.4] SPEAKER_02: Thank you.",
      "[1113.58-1114.36] SPEAKER_09: Thank you, Secretary.",
      "[1115.16-1115.83] SPEAKER_09: Director Ruscha.",
      "[1120.48-1121.16] SPEAKER_17: Thank you, Mr. Chair.",
      "[1122.32-1126.73] SPEAKER_17: So I just wanted to offer a bit of context.",
      "[1126.89-1131.79] SPEAKER_17: And the general manager, please interrupt me if I'm framing this wrong.",
      "[1132.17-1138.46] SPEAKER_17: But the conversation that we're having tonight is a framework of a potential path forward.",
      "[1139.14-1145.53] SPEAKER_17: And because of our OSS meeting went so long,",
      "[1145.51-1152.03] SPEAKER_17: we weren't able to get to through the discussion and that also I think impacted our ability to have some interim discussions.",
      "[1152.07-1175.34] SPEAKER_17: So I just want folks to you know keep keep an open mind to what staff is saying and definitely share that feedback because we're on a timeline but also just recognize that well and please if I'm saying the strong introduction but what is being presented is a concept framework and so we want so we'll get more feedback and then of course staff is going to be working very closely",
      "[1175.66-1183.09] SPEAKER_17: with our existing customers and advocacy organizations to make further refinements and give us some more stuff to look at.",
      "[1183.15-1190.29] SPEAKER_17: So I hope I didn't speak out of turn, but I just wanted to offer that for context.",
      "[1191.03-1203.53] SPEAKER_17: And I'm also listening and taking notes and I know staff is, so I would just urge if anyone has thoughts one way or another, please share them tonight since we are also on",
      "[1203.81-1207.76] SPEAKER_17: timeline with our existing partners and those contracts as well.",
      "[1207.8-1208.16] SPEAKER_17: Thank you.",
      "[1209.28-1209.92] SPEAKER_08: Thank you, Director.",
      "[1210.72-1211.41] SPEAKER_08: Director Larson.",
      "[1215.05-1215.49] SPEAKER_06: Thank you.",
      "[1215.6-1217.94] SPEAKER_06: I just have a question for Ms.",
      "[1217.98-1218.44] SPEAKER_06: Vallejos.",
      "[1219.74-1223.25] SPEAKER_06: So I saw I seen one of those slot these slides that it says there's",
      "[1223.54-1232.07] SPEAKER_06: In December of 2024, there were about 2,900 total active customers of access on demand.",
      "[1233.13-1238.29] SPEAKER_06: So there were 2,900 people, roughly, who used it in all of December.",
      "[1239.07-1239.57] SPEAKER_06: Is that right?",
      "[1240.91-1243.52] SPEAKER_20: I know that would be for the year, I believe.",
      "[1244.6-1245.28] SPEAKER_06: Let me just.",
      "[1245.42-1245.94] SPEAKER_06: OK.",
      "[1245.96-1250.95] SPEAKER_06: So 2,900 people used this service for the whole year.",
      "[1251.23-1251.69] SPEAKER_06: That's it.",
      "[1252.58-1265.27] SPEAKER_06: And so I guess what I'm trying to just understand is, if we were going to spend, say, $10 million or $15 million on 2,900 people,",
      "[1265.74-1270.81] SPEAKER_06: What do we think the equivalent is for just our regular riders?",
      "[1271.11-1272.05] SPEAKER_06: Do we have any guess?",
      "[1272.67-1275.03] SPEAKER_06: I mean, I know people have different ridership.",
      "[1275.07-1289.43] SPEAKER_06: If we have a million customers a year and it's the majority of our budget, I'm just trying to get a sense of how the per-person spend for a regular rider compares to the per-person spend for access on demand.",
      "[1291.71-1293.76] SPEAKER_20: Go ahead, Deborah.",
      "[1295.54-1299.05] SPEAKER_16: So if I can, Mr. Chair, and thank you, Director Larsen, for the question.",
      "[1299.31-1301.75] SPEAKER_16: I would not want us to conjecture and speculate.",
      "[1301.81-1303.62] SPEAKER_16: We could double back and give you those numbers.",
      "[1304.52-1310.25] SPEAKER_16: As we talk about, you use the term regular writer, you're talking about those that are using fixed route service.",
      "[1310.27-1313.41] SPEAKER_16: I just want to be clear and intentional with the language we're using going forward.",
      "[1313.39-1322.19] SPEAKER_16: So we need to assess that because it's a different level of service because with fixed route bus, we're not providing curb to curb service.",
      "[1322.53-1326.45] SPEAKER_16: And so we can double back and share that information with the board.",
      "[1327.39-1331.52] SPEAKER_16: But I think it wouldn't be fruitful for us to guesstimate because this is critically important.",
      "[1331.88-1337.39] SPEAKER_16: But as we come back and we have some guidance, we could provide that detailed information, if you will.",
      "[1337.79-1338.13] SPEAKER_16: Thank you.",
      "[1340.11-1341.17] SPEAKER_16: Thank you.",
      "[1342.51-1344.59] SPEAKER_10: Any other directors comments?",
      "[1344.61-1345.41] SPEAKER_09: Yeah, director Guzman.",
      "[1346.35-1353.88] SPEAKER_05: So I am concerned with the aligning with the ADA for the service area.",
      "[1356.37-1360.31] SPEAKER_05: District C is fairly blessed with",
      "[1360.71-1369.69] SPEAKER_05: multiple forms of transit and fixed route, where this is not a particular problem, but it is an issue in the suburban areas of the region.",
      "[1370.13-1383.77] SPEAKER_05: And it is highly concerning that we would restrict it so much where people would be left off of the system that live within a quarter mile of a commuter bus and still not be able to access this.",
      "[1386.26-1398.6] SPEAKER_05: I also think that as we proceed into the future after the demographers presentation to the finance and planning committee, a big concern will be our aging population in the region.",
      "[1399.48-1404.62] SPEAKER_05: And it's a, you know, somebody said that this is a drop in the bucket for our budget.",
      "[1405.85-1416.12] SPEAKER_05: Maybe right now, but eventually this is going to catch up with us, which is why we're having this conversation and access on demand and folks that are able to",
      "[1416.45-1430.93] SPEAKER_05: or out of need, utilize this system, need to be considered as humans first and how we serve them, which is our mission, right?",
      "[1430.95-1432.64] SPEAKER_05: They need connection as well.",
      "[1433.11-1446.55] SPEAKER_05: and not every one of them will be able to jump from a, jump, roll, walk, shuffle to a fixed route form of transportation to get them to their destinations.",
      "[1447.51-1454.08] SPEAKER_05: I have a question about the time on this, right?",
      "[1454.54-1459.35] SPEAKER_05: If it's mirroring regular service provision for the whole region,",
      "[1460.58-1468.37] SPEAKER_05: It kind of makes sense, but I would still be concerned for the reasons that emergencies don't happen on RTD schedule.",
      "[1469.37-1478.38] SPEAKER_05: And so somebody who already has a specific need for this type of transportation usage might need to go to the doctor.",
      "[1478.92-1481.61] SPEAKER_05: And what do they do if they're unable to drive?",
      "[1482.13-1492.69] SPEAKER_05: And regular bus service is not something that they can use because the buses aren't running a two o'clock in the morning emergency room visit is not unheard of and not uncommon in anybody's life.",
      "[1493.25-1496.01] SPEAKER_05: And yet what do we do to take care of those that are most vulnerable.",
      "[1497.4-1500.64] SPEAKER_05: So for me, I would really want to see some clarity around",
      "[1501.03-1502.05] SPEAKER_05: those two areas.",
      "[1503.19-1508.7] SPEAKER_05: I am frankly less concerned about minimal difference of cost savings.",
      "[1509.62-1512.14] SPEAKER_05: I mean, we're talking $5 million.",
      "[1512.18-1518.3] SPEAKER_05: That's not really the top priority for me on that part.",
      "[1518.68-1543.56] SPEAKER_05: right now it will eventually get there because this will likely continue to grow but I do want to make sure that we are basing ourselves in reality to serve the taxpayers needs and this is a need right this is not a desire as some of the other services we want to grow and create are this one is an actual need and so I want to be clear in my language on that and why I'm",
      "[1544.57-1546.91] SPEAKER_05: depositing these comments within that framework.",
      "[1547.26-1548.48] SPEAKER_05: So that would be my feedback.",
      "[1548.5-1552.99] SPEAKER_05: I'd like to see something a little bit different on those two things, the service area and the time for service.",
      "[1553.17-1553.48] SPEAKER_05: Thank you.",
      "[1554.06-1554.76] SPEAKER_05: Thank you, Director.",
      "[1555.44-1556.14] SPEAKER_05: Director Harwick.",
      "[1557.14-1559.42] SPEAKER_04: Well, thank you, Director Guzman.",
      "[1559.44-1561.75] SPEAKER_04: I'm just going to pretty much replicate everything you just said.",
      "[1561.77-1571.16] SPEAKER_04: I represent Arvada, and Arvada is actually the fastest growing aging population.",
      "[1571.36-1572.56] SPEAKER_04: However, I said that.",
      "[1572.64-1573.51] SPEAKER_04: I'm not sure I said it right.",
      "[1574.17-1579.64] SPEAKER_04: And a lot of our service is not in the areas where we have those aging people.",
      "[1580.2-1582.84] SPEAKER_04: So I'd really like to see",
      "[1583.39-1585.44] SPEAKER_04: just the boundary kept the same.",
      "[1585.56-1590.48] SPEAKER_04: I'm also really again with director Guzman keeping it as a full 24 seven.",
      "[1590.5-1606.9] SPEAKER_04: I just like I have a friend in a wheelchair and I just think about her trying like if she didn't live where she lived if she lived where I live she would have such a difficult time getting you know around her community and I won't just",
      "[1607.41-1612.9] SPEAKER_04: especially like if the service is outside of that time period, it's just precluding her life.",
      "[1612.96-1624.1] SPEAKER_04: And I know we don't all have these, the same abilities when we're riding the bus, but for a person with disability that's blind or in a wheelchair, I think that we can sort of extend them the grace that they deserve.",
      "[1625.01-1627.45] SPEAKER_04: I also would like to see the cap stay at 60.",
      "[1627.61-1640.82] SPEAKER_04: I think that, again, I know that it's a, you know, less than 10% of the population go above the 50 rides, but I think it's still like that's, we're giving them access to a free and full life.",
      "[1641.88-1650.07] SPEAKER_04: And I think if we are gonna go with the 650, I think that that to me is fine, but I also think that it would be imperative that we really,",
      "[1650.05-1677.56] SPEAKER_04: put out the live program and let let those writers know That there is another option like there's always with someone the other day she Lives about three miles away from where she works and you know She can afford it, but just barely and she didn't know about the live program So I think that there's we're missing an opportunity there specifically with these With these writers so and then my last one is just a request is it possible to get a map of",
      "[1677.54-1692.32] SPEAKER_04: like sort of like a density map of where AOD is like highly being used to sort of go with that, like thinking about, you know, West Jefferson County versus central Denver, just kind of see what that looks like.",
      "[1692.42-1699.61] SPEAKER_04: Obviously we want to anonymize the data, but I think it's sort of just would be interesting for us to know where the sort of hotspots of usage are.",
      "[1699.64-1700.91] SPEAKER_04: Thank you.",
      "[1700.95-1701.67] SPEAKER_09: Thank you, Director Harwick.",
      "[1701.87-1702.03] SPEAKER_09: Ms.",
      "[1702.05-1702.47] SPEAKER_04: Johnson.",
      "[1703.48-1721.9] SPEAKER_16: Yes, Director Harwick, if I understood you correctly, because I'm taking copious notes here, you are in support for all intents and purposes of what I hear, the modification of scenario one, keeping it at 60 trips with 650 and then one information relative to what the current usage is from a geographic vantage point.",
      "[1722.4-1723.18] SPEAKER_16: Okay, thank you.",
      "[1724.44-1725.06] SPEAKER_04: Thank you.",
      "[1725.08-1729.14] SPEAKER_04: Yeah, but I also want to keep the service areas the same as they are today.",
      "[1729.66-1731.97] SPEAKER_10: Yeah.",
      "[1731.99-1732.29] SPEAKER_10: Excellent.",
      "[1733.55-1735.49] SPEAKER_10: Director Nicholson, then Director Ruscha."
    ],
    "pre": [
      "[966.14-967.2] SPEAKER_10: Secretary Nicholson."
    ],
    "post": [
      "[1737.04-1740.7] SPEAKER_02: Yeah, just a quick follow-up onto that.",
      "[1741.68-1749.06] SPEAKER_02: When it comes to go to Director Ruscha, my brain, I lost my train of thought for a second, so.",
      "[1750.34-1751.1] SPEAKER_10: Alright, Director Ruscha.",
      "[1755.91-1757.11] SPEAKER_17: Thank you for the red rover.",
      "[1757.17-1757.97] SPEAKER_17: I wasn't prepared.",
      "[1757.99-1758.87] SPEAKER_17: I went back to my notes.",
      "[1759.38-1759.8] SPEAKER_17: Okay.",
      "[1759.82-1774.31] SPEAKER_17: So, um, anyway, I, um, so I, some of this, um, feedback I did share with staff and I, um, I don't want to be repetitive, but I also just want to be really transparent with my, my colleagues, uh, because we haven't had this public conversation yet."
    ]
  },
  {
    "start": 1737.04,
    "end": 2025.43,
    "text": [
      "[1737.04-1740.7] SPEAKER_02: Yeah, just a quick follow-up onto that.",
      "[1741.68-1749.06] SPEAKER_02: When it comes to go to Director Ruscha, my brain, I lost my train of thought for a second, so.",
      "[1750.34-1751.1] SPEAKER_10: Alright, Director Ruscha.",
      "[1755.91-1757.11] SPEAKER_17: Thank you for the red rover.",
      "[1757.17-1757.97] SPEAKER_17: I wasn't prepared.",
      "[1757.99-1758.87] SPEAKER_17: I went back to my notes.",
      "[1759.38-1759.8] SPEAKER_17: Okay.",
      "[1759.82-1774.31] SPEAKER_17: So, um, anyway, I, um, so I, some of this, um, feedback I did share with staff and I, um, I don't want to be repetitive, but I also just want to be really transparent with my, my colleagues, uh, because we haven't had this public conversation yet.",
      "[1774.76-1792.08] SPEAKER_17: And just high level, some of the things that I had shared was, you know, first of all, we don't want to put one proposal out before the community and get feedback like the one that we've had out for several months and then come back with something else that looks like less than what we originally proposed.",
      "[1792.18-1795.13] SPEAKER_17: And so one of the pain points that I had was just the idea of",
      "[1795.43-1799.34] SPEAKER_17: going up to 650 for the initial fare because that's not what we originally put out there.",
      "[1799.68-1810.56] SPEAKER_17: So one of the things that I urge is that if we put an offer on the table, so to speak, we don't take it back.",
      "[1810.96-1812.6] SPEAKER_17: That's kind of our baseline now.",
      "[1813.36-1818.55] SPEAKER_17: And another piece of feedback I had is that where something is not",
      "[1820.34-1832.9] SPEAKER_17: For every change we make, which essentially results in a reduction of a service of some kind or an increase in price, we really have to justify that line by line.",
      "[1833.28-1841.73] SPEAKER_17: So for example, if we decide that we are going to strictly align with service hours, then we have to justify it.",
      "[1841.89-1843.23] SPEAKER_17: It doesn't cost us any more money.",
      "[1843.39-1844.41] SPEAKER_17: It's not going to save us a penny.",
      "[1844.86-1848.2] SPEAKER_17: If somebody, you know, uses on demand,",
      "[1849.01-1853.46] SPEAKER_17: 15 or 20 minutes or an hour before fixed drought starts.",
      "[1855.1-1860.01] SPEAKER_17: Likewise, it's not costing us that I could see a lot of money, if any.",
      "[1860.41-1864.88] SPEAKER_17: for us to offer service outside of our general service area.",
      "[1865.96-1868.86] SPEAKER_17: I know that was flagged in the peer review.",
      "[1869.18-1888.16] SPEAKER_17: So I, because this idea has been on the table for so many months, I also want to caution us about the service area idea because if we restrict the service, that means there are people who currently are using AOD and they're going to lose it.",
      "[1888.88-1889.33] SPEAKER_17: So",
      "[1890.27-1900.96] SPEAKER_17: I, um, so that was just, I mean, that was just the, the kind of like high level, like, um, theme that I had in, in the feedback.",
      "[1901.6-1914.84] SPEAKER_17: Um, and also, you know, I'm going back to the, uh, initial like a fair, um, we also want to be really careful about what we think.",
      "[1915.19-1918.38] SPEAKER_17: is inexpensive because it's really relative.",
      "[1918.42-1937.89] SPEAKER_17: So for some folks using the service and they have like a fixed income or very limited income, if we even do you know 450 which would be parity with excess ride and I think I could accept that but like say we go up to 650 or we do this tiered system",
      "[1938.44-1946.85] SPEAKER_17: then for some folks, they are not going to be able to write or they're going to be choosing, do I get to the doctor or do I buy food for tonight?",
      "[1947.01-1950.72] SPEAKER_17: So I just wanted to put that out there.",
      "[1951.12-1960.91] SPEAKER_17: And finally, well, actually, I'll stop there.",
      "[1960.93-1968.33] SPEAKER_17: I concurred with what a lot of other directors said in terms of keeping the program as is as much as we can.",
      "[1969.02-1981.23] SPEAKER_17: I think that, but I also just want to commend staff, you know, because we are at a much different place than where we were several months ago.",
      "[1981.87-1983.67] SPEAKER_17: This is a totally different conversation.",
      "[1984.4-1985.96] SPEAKER_17: really slashing this program.",
      "[1986.74-1992.2] SPEAKER_17: And staff did a lot of work and we spent several months, we almost voted on this a few months ago.",
      "[1992.24-2001.11] SPEAKER_17: And they listened to us as directors and they listened to community because as you know, we've had hundreds of public comments over several months on this.",
      "[2001.75-2009.62] SPEAKER_17: And they said, okay, we can take a timeout, we can reassess, we can get some different data, we can, you know, kind of present a new paradigm.",
      "[2009.64-2013.44] SPEAKER_17: So again, what's before us today is a sketch of ideas, the feedback is good.",
      "[2013.69-2018.73] SPEAKER_17: But I really do want to commend staff for listening and working with us in partnership.",
      "[2018.75-2019.67] SPEAKER_17: So thank you.",
      "[2019.69-2021.08] SPEAKER_17: And thank you.",
      "[2022.28-2023.14] SPEAKER_08: Thank you, Director Ruscha.",
      "[2023.32-2024.05] SPEAKER_08: Director Nicholson.",
      "[2025.43-2026.76] SPEAKER_02: Thank you."
    ],
    "pre": [
      "[1731.99-1732.29] SPEAKER_10: Excellent.",
      "[1733.55-1735.49] SPEAKER_10: Director Nicholson, then Director Ruscha."
    ],
    "post": [
      "[2028.12-2042.98] SPEAKER_02: Is there any step during enrollment of AAR and AOD where we ask people if they are enrolled in the live program and ask them, hey, we're taking 14 other pieces of documentation from you.",
      "[2043.0-2046.98] SPEAKER_02: I mean, AAR is remarkably complicated to sign up for.",
      "[2047.72-2053.91] SPEAKER_02: Is there any part of that process where we try to enroll them in the live program as well?",
      "[2053.95-2055.07] SPEAKER_02: And then I have a quick follow up."
    ]
  },
  {
    "start": 2025.43,
    "end": 3510.72,
    "text": [
      "[2025.43-2026.76] SPEAKER_02: Thank you.",
      "[2028.12-2042.98] SPEAKER_02: Is there any step during enrollment of AAR and AOD where we ask people if they are enrolled in the live program and ask them, hey, we're taking 14 other pieces of documentation from you.",
      "[2043.0-2046.98] SPEAKER_02: I mean, AAR is remarkably complicated to sign up for.",
      "[2047.72-2053.91] SPEAKER_02: Is there any part of that process where we try to enroll them in the live program as well?",
      "[2053.95-2055.07] SPEAKER_02: And then I have a quick follow up.",
      "[2059.84-2062.43] SPEAKER_20: I will have to find out about that as part of the process.",
      "[2062.83-2067.73] SPEAKER_20: Um, and we will confirm if that is, you know, how that is handled as, as part of the process.",
      "[2068.86-2069.07] SPEAKER_02: Yeah.",
      "[2069.16-2079.45] SPEAKER_02: So, yeah, as a, as a first thing I would say that since we're going to be updating this to offer the, the live discount and, and not make it free, uh, it should be required as part of the process.",
      "[2079.51-2087.98] SPEAKER_02: If you're going through to sign up for AOD or AAR, some point in that process to set, to ask someone to affirm that they are either already signed up or,",
      "[2088.23-2092.59] SPEAKER_02: haven't signed up or whatever, and then give them the opportunity to make it super easy.",
      "[2092.65-2099.22] SPEAKER_02: Because we only have 15,000 people signed up for live right now, and we have 180 something thousand boardings every day.",
      "[2099.34-2105.89] SPEAKER_02: And I think only about half the people in AOD are currently signed up for, or AAR currently signed up for live.",
      "[2105.91-2108.29] SPEAKER_02: So definitely something I'd like to see there.",
      "[2108.33-2117.66] SPEAKER_02: The second thing, I want to echo what Director Ruscha said about the effect on people who",
      "[2118.22-2134.3] SPEAKER_02: are low income to having these fares, but I want to take it from the other side, which is if you don't have a lot of money and you need to get around to a lot of places, then 40 trips maybe, or whatever the number ends up being, not nearly enough in a way that someone who makes more money",
      "[2134.28-2137.64] SPEAKER_02: can probably have some discretionary to be like, oh, I've run out of trips.",
      "[2137.72-2140.97] SPEAKER_02: I can afford to take an extra three or five or whatever.",
      "[2140.99-2145.11] SPEAKER_02: So I'm not sure that that needs to be fit into the policy here.",
      "[2145.17-2147.71] SPEAKER_02: I'm wary about trying to do too much too quickly.",
      "[2148.03-2158.52] SPEAKER_02: But I do think we need to get a report from you after, I don't know, six months a year that looks at how many trips are people on live using?",
      "[2158.76-2159.74] SPEAKER_02: Are they maxing out?",
      "[2160.18-2162.35] SPEAKER_02: Or are we seeing sort of the same curve?",
      "[2162.33-2175.02] SPEAKER_02: from live users as we do from regular users right now, and that might inform us to take action a year from now to try to offer the right service for people who need it.",
      "[2175.06-2177.1] SPEAKER_02: Some live people make decent incomes.",
      "[2177.28-2184.65] SPEAKER_02: Some of them are literally broke, and we need to recognize that those two groups of people have very different lived experiences.",
      "[2185.37-2186.22] SPEAKER_10: Thank you, Secretary.",
      "[2186.32-2186.47] SPEAKER_10: Ms.",
      "[2186.51-2186.86] SPEAKER_10: Johnson?",
      "[2187.24-2190.24] SPEAKER_16: Yes, thank you very much, Director Nicholson.",
      "[2190.37-2193.09] SPEAKER_16: Mr. Chair, thank you, Director Nicholson, for the comments.",
      "[2193.55-2210.17] SPEAKER_16: And what I will say in reference to your request, it appeared to be a directive, but I would just offer this up to you that once we collectively agree upon the path forward in this Board acts, we can then assess what might be most prudent, because at this point in time, we don't know what we don't know.",
      "[2210.19-2215.98] SPEAKER_16: And relative to what you just asked, I can't commit to that without knowing what we intend to do.",
      "[2216.14-2217.88] SPEAKER_16: So I just had to say that for the record.",
      "[2218.08-2219.1] SPEAKER_16: because it seemed as if Ms.",
      "[2219.16-2222.77] SPEAKER_16: Baleos was giving direction, and I don't think that's appropriate at this juncture.",
      "[2223.07-2223.53] SPEAKER_10: Thank you.",
      "[2225.01-2225.33] SPEAKER_10: Thank you.",
      "[2225.35-2225.41] SPEAKER_10: Ms.",
      "[2225.43-2226.01] SPEAKER_10: Director Larson.",
      "[2227.75-2228.19] SPEAKER_10: Thank you.",
      "[2228.21-2234.76] SPEAKER_06: I was just kind of doing some stuff on my calculator.",
      "[2234.88-2245.25] SPEAKER_06: And so if we only have 3,000 people who use excess on demand, I mean, it seems like the disabled population",
      "[2245.57-2251.46] SPEAKER_06: You know, it might be 300,000 people in Denver or something, you know, much, much larger.",
      "[2252.94-2259.5] SPEAKER_06: Do we, how do, how confident are we of our projection that it'll stay at around, I mean, or, or however much we think it'll increase?",
      "[2259.52-2271.05] SPEAKER_06: I mean, what do we think the total number of active users might become and why won't it become, you know, several, many multiples more than 3,000 or so?",
      "[2276.67-2285.48] SPEAKER_16: First, if I may, just for everyone's identification, you probably have heard this over the course of several months in the public comment discussions.",
      "[2286.18-2301.38] SPEAKER_16: When we talk about access on demand, currently as it's configured, recognizing that we're using private entities, transportation network companies in particular, not all of the vehicles are outfitted to be wheelchair accessible.",
      "[2301.65-2309.43] SPEAKER_16: So that's a critical element when we're talking about the population because there's different disabilities that individuals have.",
      "[2309.51-2316.4] SPEAKER_16: Some may have cognitive, somebody may be using a mobility device, which can't be accommodated going forward.",
      "[2316.42-2319.35] SPEAKER_16: So I just wanted to provide that context prior to Ms.",
      "[2319.37-2324.23] SPEAKER_16: Vallejo's answering the question because that has not been factored into this conversation this evening.",
      "[2324.25-2325.66] SPEAKER_16: And I believe it's a germane point.",
      "[2327.68-2328.28] SPEAKER_16: Thank you, Director.",
      "[2328.78-2333.16] SPEAKER_20: And I don't think I need to add anything that was really exactly what I was going to say.",
      "[2333.22-2338.85] SPEAKER_20: Not everyone is able to use the access on demand service that is eligible for excessive ride.",
      "[2339.25-2340.63] SPEAKER_20: Other is a difference there.",
      "[2341.29-2342.21] SPEAKER_06: Can I just follow up?",
      "[2342.23-2349.16] SPEAKER_06: But I mean, surely many more people than 3000 in the metro area would be eligible though.",
      "[2350.68-2355.45] SPEAKER_20: Well, and again, we have continued continue to see substantial growth.",
      "[2355.86-2360.29] SPEAKER_20: in the number of customers that are beginning to use the service.",
      "[2360.75-2367.62] SPEAKER_20: Again, the trips that we are seeing continue to grow even into this year, so we are seeing quite significant growth still.",
      "[2370.76-2371.08] SPEAKER_10: Thank you.",
      "[2371.26-2371.58] SPEAKER_10: Thank you.",
      "[2372.39-2372.69] SPEAKER_10: Thank you.",
      "[2373.93-2375.39] SPEAKER_10: Any further questions, comments?",
      "[2377.63-2377.81] SPEAKER_10: Ms.",
      "[2377.87-2378.61] SPEAKER_10: Johnson and Ms.",
      "[2378.63-2380.64] SPEAKER_10: Vallejoz, thank you very much for the presentation.",
      "[2380.68-2382.96] SPEAKER_10: I hope this was helpful feedback for going forward.",
      "[2383.42-2384.1] SPEAKER_10: So thank you.",
      "[2384.72-2385.82] SPEAKER_16: Yes, thank you, Mr. Chair.",
      "[2385.86-2388.71] SPEAKER_16: This was in the sense that we do have some guidance now.",
      "[2388.75-2391.73] SPEAKER_16: We know what we need to do as we do further outreach.",
      "[2391.77-2394.16] SPEAKER_16: So thank you all very much for the opportunity.",
      "[2394.68-2404.35] SPEAKER_16: And when we come back in July with a recommended action, hopefully we can all rally around that, recognizing the public comments that we heard in the direction in which you provide it.",
      "[2404.37-2404.73] SPEAKER_16: Thank you.",
      "[2405.01-2405.31] SPEAKER_05: Thank you.",
      "[2405.81-2406.39] SPEAKER_05: Director Guzman.",
      "[2406.8-2410.18] SPEAKER_05: Will that recommended action be going through operation safety and security?",
      "[2411.92-2412.06] SPEAKER_10: Ms.",
      "[2412.1-2412.48] SPEAKER_10: Johnson.",
      "[2412.78-2414.75] SPEAKER_16: Yes, thank you very much, Mr. Chair.",
      "[2414.81-2417.32] SPEAKER_16: And thank you, Director Guzman.",
      "[2417.6-2419.71] SPEAKER_16: I apologize for the question.",
      "[2420.01-2422.61] SPEAKER_16: Most definitely we will go through the committee procedure.",
      "[2422.63-2425.28] SPEAKER_16: The only reason why this didn't happen because it's time sensitive.",
      "[2425.7-2426.3] SPEAKER_16: So thank you.",
      "[2426.98-2427.68] SPEAKER_10: Thank you very much.",
      "[2428.9-2429.22] SPEAKER_10: All right.",
      "[2429.3-2430.38] SPEAKER_10: Well, thank you again, Ms.",
      "[2430.42-2430.86] SPEAKER_10: Filaios.",
      "[2431.82-2432.1] SPEAKER_10: All right.",
      "[2432.38-2432.93] SPEAKER_10: Moving on.",
      "[2432.99-2435.27] SPEAKER_10: Thank you, directors, for the questions and conversations.",
      "[2435.57-2441.72] SPEAKER_10: We're going to be moving to our committee reports, not, not to be the, the time police or anything.",
      "[2441.76-2445.2] SPEAKER_10: We are at 8 31 PM and we've been going at this since 3 30.",
      "[2445.76-2449.49] SPEAKER_10: If committee reports could be less than a minute, that'd be greatly appreciated.",
      "[2450.11-2452.27] SPEAKER_10: Audit committee chair music.",
      "[2452.29-2453.27] SPEAKER_10: What would you like to share?",
      "[2454.21-2455.01] SPEAKER_13: Thank you, Mr. Chair.",
      "[2455.05-2456.68] SPEAKER_13: We did not meet in April or May.",
      "[2456.72-2458.52] SPEAKER_13: Our next meeting is June 12, 2025.",
      "[2459.1-2460.2] SPEAKER_13: That concludes my report.",
      "[2460.58-2461.28] SPEAKER_10: Thank you.",
      "[2461.3-2461.98] SPEAKER_10: Thank you very much.",
      "[2463.94-2466.39] SPEAKER_10: Finance and Planning Committee Report, Committee Chair Guzman.",
      "[2466.81-2467.47] SPEAKER_05: Thank you, Mr. Chair.",
      "[2468.67-2476.22] SPEAKER_05: The Finance and Planning Committee met Tuesday, May 13th, discussed a handful of items, received a report from our state demographer, which was really awesome.",
      "[2476.96-2483.55] SPEAKER_05: Directors are reminded to email the board office if you had any follow-up questions or things specific to your sub-district so we can send that all at once.",
      "[2483.66-2485.12] SPEAKER_05: to receive an answer to the whole board.",
      "[2485.82-2494.01] SPEAKER_05: Received an update from DOTI for the East Colfax BRT and three items came out of committee, which will be before us tonight.",
      "[2495.78-2507.07] SPEAKER_05: Just want to thank the committee for all of the hard work and the next meeting for the finance and planning committee is scheduled for Tuesday, June 10th at 5.30 PM.",
      "[2507.21-2507.59] SPEAKER_05: Thank you.",
      "[2508.65-2509.32] SPEAKER_10: Thank you, Director.",
      "[2510.5-2515.14] SPEAKER_10: Committee Chair Ruscio or Committee Chair Harwick, what would you like to share for OSS?",
      "[2516.11-2516.71] SPEAKER_17: I'll take it, sir.",
      "[2517.65-2517.97] SPEAKER_17: Thank you.",
      "[2518.03-2520.8] SPEAKER_17: So we met remotely on Wednesday, May 14th.",
      "[2521.64-2524.2] SPEAKER_17: We gaveled in at 5.34 p.m.",
      "[2524.41-2526.83] SPEAKER_17: and wrapped up at 9.44 p.m.",
      "[2527.49-2529.71] SPEAKER_17: We had extensive public comments.",
      "[2529.87-2532.22] SPEAKER_17: The most I've ever seen at any OSS meeting.",
      "[2533.24-2533.78] SPEAKER_17: That was great.",
      "[2533.88-2535.1] SPEAKER_17: Come visit us anytime.",
      "[2536.17-2540.41] SPEAKER_17: It's always nice to know that people are listening to our podcast and by that I mean our YouTube channel.",
      "[2540.39-2563.28] SPEAKER_17: But two major items that went on the consent calendar for tonight's meeting is the 2025-2028 Title VI program update, just ensuring that we stay in compliance with federal law, civil rights protections, and meet the needs of our customers, as well as the Allied Universal Security Services Contract Extension.",
      "[2563.26-2568.22] SPEAKER_17: FNP authorized a budget transfer, which had no financial impact.",
      "[2568.34-2570.25] SPEAKER_17: It was just moving from one department to another.",
      "[2570.29-2579.0] SPEAKER_17: And then we filed that up with a vote to extend that contract for another year with the cost of up to just a little over 22 million.",
      "[2579.78-2583.24] SPEAKER_17: And we did have four discussion items, two of which were heard.",
      "[2584.28-2588.41] SPEAKER_17: So we had the Vision Zero update from GM CEO Johnson.",
      "[2588.84-2593.87] SPEAKER_17: As you might recall, we passed a Vision Zero resolution last year, and so that planning process is underway.",
      "[2594.69-2596.93] SPEAKER_17: We had a customer communications update.",
      "[2597.65-2608.17] SPEAKER_17: Stuart Summers led an excellent presentation, discussing how we handle communications, some tech updates, customer service aspects.",
      "[2608.15-2611.49] SPEAKER_17: real-time information and service alerts and things like that.",
      "[2612.25-2619.59] SPEAKER_17: Unfortunately, we did hit our four-hour mark before we could finish our agenda items, and even though the nuggets weren't playing, folks wanted to go, and we were tired.",
      "[2620.19-2631.4] SPEAKER_17: So we moved the on-demand item to the nice meeting, which we just heard, and then we'll be hearing Paratransit Legacy Customer Protection's proposal next month.",
      "[2631.38-2643.48] SPEAKER_17: So for those of you who have been tracking what we're doing with paratransit, I strongly encourage you to come visit us at OSSX month and weigh in so we get your feedback before we come back with something more final.",
      "[2644.38-2653.02] SPEAKER_17: Our next meeting is Wednesday, June 11th at 5.30, same time, same place, online or on the phone.",
      "[2653.8-2654.1] SPEAKER_17: Thank you.",
      "[2654.56-2655.94] SPEAKER_10: Thank you, committee chair.",
      "[2656.38-2659.04] SPEAKER_10: Uh, now to for performance committee chair Guzman.",
      "[2659.46-2660.06] SPEAKER_10: I get it.",
      "[2660.72-2661.62] SPEAKER_05: Thank you, Mr. Chair.",
      "[2662.04-2663.89] SPEAKER_05: Performance committee met Monday, May 12th, 2025.",
      "[2663.93-2679.65] SPEAKER_05: Uh, I, I, the, the committee chair presented a draft proposal that I had worked on previously with vice chair Gucci and Ritter for the 2025 general manager, CEO performance assessment form and process that needed to be updated to seek input from the committee and other directors.",
      "[2679.63-2692.12] SPEAKER_05: to find a way forward for the rest of the year based on the current 2025 general manager CO short term goals and the respective adjustments made to the scoring points based on our votes in January.",
      "[2692.64-2694.0] SPEAKER_05: I've received some feedback.",
      "[2694.18-2697.45] SPEAKER_05: I continue to invite directors to submit the feedback.",
      "[2697.49-2699.43] SPEAKER_05: If you have not reviewed that meeting, please do so.",
      "[2700.01-2702.72] SPEAKER_05: And any questions you may have, please email me or call me.",
      "[2703.02-2705.28] SPEAKER_05: I am happy to engage in that conversation.",
      "[2706.06-2714.48] SPEAKER_05: Of course, we are doing that with participation and a lot of communication with the general manager CEO, Deborah Johnson.",
      "[2714.85-2720.03] SPEAKER_05: The next meeting of the performance committee is scheduled for June 2, 2025 at 8.30 a.m.",
      "[2720.61-2725.8] SPEAKER_05: I really want to encourage all of you, directors, to please participate in that meeting.",
      "[2726.54-2727.04] SPEAKER_05: Two reasons.",
      "[2727.2-2728.36] SPEAKER_05: One, we are going to receive.",
      "[2729.48-2735.99] SPEAKER_05: I hope I don't get this wrong because I don't have my work plan in front of me, but the employee survey results in the beginning of that meeting.",
      "[2736.11-2738.27] SPEAKER_05: And then we will adjourn into executive session.",
      "[2738.61-2743.33] SPEAKER_05: for the second quarterly one-on-one opportunity with our general manager CEO.",
      "[2743.87-2757.71] SPEAKER_05: And that is part of our contracted agreement with the general manager CEO to receive information from her and provide feedback regarding personnel matters.",
      "[2759.13-2766.42] SPEAKER_05: Additionally, the performance committee is set to have a second meeting in June because of that quarterly check-in.",
      "[2767.36-2772.24] SPEAKER_05: The second meeting is planned, I believe, for June 23rd at 8.30 a.m.",
      "[2772.26-2781.75] SPEAKER_05: And that is in order to do a deep dive into our community and customer surveys, which align with our community value and customer excellent strategic initiatives.",
      "[2782.32-2786.4] SPEAKER_05: And I would again encourage all directors to participate in that meeting as well.",
      "[2786.75-2793.68] SPEAKER_05: which is the overview of the current status of the agency's surveys and where we're at with regard to public.",
      "[2794.1-2801.89] SPEAKER_05: It will inform the process for setting goals and priorities for the 2026 year, which we are also doing all at the same time.",
      "[2802.09-2815.81] SPEAKER_05: So prioritizing what is important for our customers, the survey reports are a great opportunity to engage with direct feedback from our constituents in all areas of the agency.",
      "[2816.27-2822.8] SPEAKER_05: I do believe a little birdie has told me on one of the buses that these should be really positive discussions.",
      "[2823.46-2833.02] SPEAKER_05: So if you need more than that invitation, please signal tonight and I will call you and email you and hound you to be on these meetings because I think they're really important for all of us.",
      "[2833.06-2833.78] SPEAKER_05: Thank you.",
      "[2834.29-2835.59] SPEAKER_10: Thank you committee chair goes on.",
      "[2836.43-2837.23] SPEAKER_10: All right, moving on.",
      "[2838.05-2845.43] SPEAKER_10: We're going to do the approval of board meeting minutes and committee reports, the board and committee meeting minutes were included in the board packet.",
      "[2846.15-2850.3] SPEAKER_10: Are there any corrections from the board for the minutes to be approved this evening.",
      "[2853.51-2854.19] SPEAKER_10: Any corrections.",
      "[2855.57-2855.91] SPEAKER_10: All right.",
      "[2856.25-2862.74] SPEAKER_10: Unless there's objection to considering the minutes all the same time, my please have a motion to approve the minutes for the following meetings.",
      "[2863.38-2874.98] SPEAKER_10: The April 9th, 2025 operation safety and security committee, the April 29th, 2025 board meeting, the May 12th, 2025 performance committee, May 13th, 2025 finance and planning committee.",
      "[2875.8-2881.99] SPEAKER_10: May 14th, 2025, Operation Safety and Security Committee, and then May 22nd, 2025, Executive Committee.",
      "[2882.39-2883.25] SPEAKER_10: So moved, Guzman.",
      "[2883.59-2884.67] SPEAKER_10: I have the Guzman.",
      "[2885.59-2886.81] SPEAKER_09: Second.",
      "[2886.83-2887.11] SPEAKER_09: Second.",
      "[2887.29-2888.31] SPEAKER_10: I'm going to give it to Guzman.",
      "[2891.7-2895.52] SPEAKER_10: So I heard Director Guzman as the mover and Director Guzman as the second.",
      "[2895.66-2897.1] SPEAKER_10: Is there any discussion on this motion?",
      "[2901.77-2902.39] SPEAKER_10: Okay.",
      "[2902.41-2904.03] SPEAKER_10: Seeing none, I'll now call the vote.",
      "[2904.19-2905.79] SPEAKER_10: Are there any no votes on this action?",
      "[2908.32-2912.85] SPEAKER_10: It'll pass 14, zero, and one absent.",
      "[2914.57-2914.95] SPEAKER_10: Excellent.",
      "[2915.66-2915.98] SPEAKER_10: All right.",
      "[2916.02-2920.55] SPEAKER_10: Moving on, it will be our chairs report.",
      "[2920.95-2926.46] SPEAKER_10: Due to the late hour, I will be quoting my principal and saying, I am giving you all the gift of time.",
      "[2926.71-2935.52] SPEAKER_10: And all I can say with my chair's report is we will have a border treat on June 7th talking about our 2026 priorities for the agency.",
      "[2936.12-2938.63] SPEAKER_10: Again, directors, hopefully you all can make that.",
      "[2938.67-2943.27] SPEAKER_10: It'll be a very healthy discussion, a very hearty discussion, I guarantee.",
      "[2943.76-2946.24] SPEAKER_10: But please make sure you have that marked down on your calendars.",
      "[2946.74-2947.22] SPEAKER_10: Thank you.",
      "[2950.83-2953.21] SPEAKER_07: Did you want to remind everybody about the survey we sent you?",
      "[2953.23-2954.21] SPEAKER_10: Of course, thank you.",
      "[2954.63-2961.56] SPEAKER_10: And of course, directors, you'll see in my weekly update, there was a survey that might have been passed too.",
      "[2962.04-2964.56] SPEAKER_10: And if you've not filled out that survey, please do so.",
      "[2965.0-2968.22] SPEAKER_10: Thank you for the directors who did fill it in.",
      "[2968.44-2970.26] SPEAKER_10: So that's okay.",
      "[2970.36-2976.45] SPEAKER_10: If we could get that in by Monday morning, that'd be excellent.",
      "[2976.49-2978.27] SPEAKER_10: I'll include that in my weekly update though.",
      "[2978.47-2978.89] SPEAKER_10: Thank you.",
      "[2980.14-2984.51] SPEAKER_10: I'll give it now over to you, GMCO Johnson.",
      "[2984.53-2998.39] SPEAKER_16: Thank you very much, Mr. Chair, and by to recognize the lateness of the hour, I just have a couple of elements that I'll share with you that are in alignment with our activities and strategic endeavors since our last board meeting on Tuesday, April 29th.",
      "[3000.31-3009.1] SPEAKER_16: One notable aspect is the legislative conference held by the American Public Transportation Association from May 18th through the 20th.",
      "[3009.45-3022.07] SPEAKER_16: In Washington DC, just for everyone's edification, this annual conference is an opportunity for public transportation industry professionals across the nation to visit Washington DC and connect with policymakers, implementers, and their staffs.",
      "[3022.75-3033.05] SPEAKER_16: The conference helps educate and inform active members on important federal legislation and policy initiatives and affords an unparalleled opportunity to shape the industry's positions in federal advocacy agenda.",
      "[3033.51-3044.53] SPEAKER_16: I along with directors of Keith Chandler and Guchin Ritter and government relations officer Michael Davies attended conference sessions and meetings with members of Colorado's congressional delegation and their staffs.",
      "[3044.55-3060.05] SPEAKER_16: While chairing an APTA committee meeting on Sunday, May 8th, I personally engaged with Tariq Bakari who is the acting administrator of the Federal Transit Administration who shared his views and inputs as it relates to public transit as well as the importance of federal and local partnerships.",
      "[3060.5-3067.79] SPEAKER_16: Just yesterday, Tuesday, May 27th, I along with members of my team met with individuals representing the Alliance to Transform Transportation.",
      "[3068.55-3073.93] SPEAKER_16: As you may be aware, it's a coalition of groups on transit related matters in Colorado.",
      "[3074.57-3089.83] SPEAKER_16: Alliance representatives in attendance included Executive Director of the Colorado Public Interest Research Group, Danny Katz, or Co-Purg, as we refer to it, Jill Lockenture, Executive Director of the Denver Streets Partnership, Portia Prescott, President of the Rocky Mountain NAACP,",
      "[3090.22-3097.98] SPEAKER_16: uh, branch, uh, the state conference representing Colorado, Montana, and Wyoming, Dennis Hawkins representing the amalgamated transit union 10 01.",
      "[3098.38-3106.72] SPEAKER_16: Matt Fromer representing Transportation and Land Use, well, he is the Transportation and Land Use Policy Manager from the Southwest Energy Efficiency Project.",
      "[3107.18-3111.58] SPEAKER_16: The meeting really was focused on Alliance's vision for transit in the Denver region.",
      "[3112.4-3120.26] SPEAKER_16: As you know, they have been very vocal in which they're seeking to increase funding for transit in the Denver region by $420 million per year.",
      "[3120.54-3126.31] SPEAKER_16: to bolster the frequency and availability of transit services in the metro area.",
      "[3128.34-3141.38] SPEAKER_16: From RTD's perspective, questions were posed relative to how that $420 million figure was derived and they explained how that came about with the work they had done with the third party entity.",
      "[3141.6-3146.57] SPEAKER_16: of very bare bones relative to providing some information.",
      "[3147.11-3162.98] SPEAKER_16: And then we talked about the agency's focus, which all of you are very well aware that we are laser focused on asset renewal, state of good repair, and rightsizing transit service and alignment with RTD's branded comprehensive operational analysis being the system optimization plan.",
      "[3163.82-3177.8] SPEAKER_16: Related to personal security, as was recently reported, RTD experienced a 60% reduction in security-related calls for service, as well as a three-year decrease in reports of criminal activities between 2022 and 2025 at Denver Union Station.",
      "[3177.84-3192.38] SPEAKER_16: The decrease is representative of concerted efforts to restore and maintain a welcoming transit environment within the critical multi-modal transit hub, and following a collaborative and multifaceted strategy aimed at enhancing",
      "[3192.73-3197.76] SPEAKER_16: personal safety and security through crime prevention through environmental design methodologies.",
      "[3198.11-3204.12] SPEAKER_16: This effort would have not have been a success without the commitment of numerous agency employees as well as support from the city and county of Denver.",
      "[3205.48-3214.31] SPEAKER_16: It's police department, the downtown Denver partnerships, Sage hospitality, the lower Denver neighborhood association, as well as several local businesses and downtown Denver residents.",
      "[3214.85-3221.12] SPEAKER_16: Fair enforcement has also increased in recent months, which is the result of RTDs growing ranks of sworn police officers",
      "[3221.43-3236.09] SPEAKER_16: haven't been trained to perform this function alongside the contracted team that we have in security with Allied Universal personnel who had primarily been responsible for this responsibility.",
      "[3236.61-3244.62] SPEAKER_16: I look forward to sharing additional details regarding the impacts of these efforts during the June Performance Committee, which you heard Committee Chair Guzman reference.",
      "[3244.91-3251.4] SPEAKER_16: When I along with staff will present data related to annual customer community and employee surveys that have recently concluded.",
      "[3251.44-3272.23] SPEAKER_16: On a related note, the agency has proactively increased its transit police officer presence at Denver Union Station and across the agency's downtown Denver sector to support the personal safety and security of customers and visitors attending major events and activity, notably as we know, while we're no longer in the hockey playoffs and NBA, but",
      "[3272.7-3276.89] SPEAKER_16: people had a welcoming experience in and around our facilities.",
      "[3277.33-3288.9] SPEAKER_16: And RTD PD had increased patrols at Denver Union Station and bus stops and rail stations, the high of, before the high profile events, which included the playoff games I just referenced.",
      "[3288.92-3293.54] SPEAKER_16: And this coincides with increasing Denver police patrols throughout the downtown area.",
      "[3294.18-3301.07] SPEAKER_16: And RTD and DPD are working closely to collaborate to support enhanced safety for the traveling public.",
      "[3303.19-3315.85] SPEAKER_16: And moreover, data and metrics related to personal safety and security are now conveniently located on the recently created security related metrics page, and we've actually showcased that on other social media channels as well.",
      "[3317.09-3329.71] SPEAKER_16: As it relates to our customer excellence in relation to the strategic priorities of customer excellence and employee ownership, I shared yesterday with the board the last of the 31 light rail speed restrictions put into place last year on the DH",
      "[3330.23-3332.93] SPEAKER_16: and E and R lines was lifted as of yesterday morning.",
      "[3334.01-3338.54] SPEAKER_16: I want to give a special shout out to our maintenance of way teams that have done yeoman's work.",
      "[3338.56-3348.25] SPEAKER_16: The final speed restriction, which was approximately 400 feet in southbound segment north of south more station and was removed after crews completed those repairs.",
      "[3350.98-3360.05] SPEAKER_16: Keeping in mind those rigorous restrictions were put into place due to the fact that we enhanced our inspections of track",
      "[3360.45-3365.92] SPEAKER_16: back in May 2024 as an enhanced focus on maintaining the agency's assets and a state of good repair.",
      "[3366.42-3370.18] SPEAKER_16: At the time, you know, crews found several minor issues and track imperfections.",
      "[3370.62-3382.99] SPEAKER_16: So as I said before, I thank and congratulate all the agency employees who worked tirelessly over the course of these 11 months.",
      "[3383.29-3387.0] SPEAKER_16: And like I said, a special shout out to MOW.",
      "[3388.68-3403.23] SPEAKER_16: I would be remiss if I didn't state that while this is a cost to celebrate, I shared previously as we look at our infrastructure and it continues to age, this will be par for the course, but since we're ahead of where we were before, we will see less of an impact, I'm certain.",
      "[3404.05-3411.82] SPEAKER_16: And last, but certainly not least, I'm pleased to welcome RTD's new Chief Financial Officer, Kelly Mackey, who's in the audience, she's given a wave.",
      "[3412.14-3414.02] SPEAKER_16: who began her tenure on May 12th.",
      "[3414.34-3419.35] SPEAKER_16: And this is her in her first in-person board meeting while we introduced her at the Finance and Planning Committee.",
      "[3420.21-3422.67] SPEAKER_16: You guys are real people, not figments of our imagination.",
      "[3422.69-3424.41] SPEAKER_16: So I wanted to ensure I did that here.",
      "[3424.47-3429.94] SPEAKER_16: So with that, I will yield the floor so we can move on to the rest of the matters that we have before.",
      "[3429.96-3431.56] SPEAKER_16: So thank you very much, Mr. Chair.",
      "[3434.31-3436.09] SPEAKER_09: Thank you, GMCO Johnson.",
      "[3436.97-3439.83] SPEAKER_09: Any comments or questions for GMCO Johnson?",
      "[3443.0-3443.4] SPEAKER_09: Yeah.",
      "[3448.41-3449.07] SPEAKER_10: Very exciting.",
      "[3449.41-3450.95] SPEAKER_10: And Kelly, welcome to the team.",
      "[3451.47-3451.83] SPEAKER_10: Thank you.",
      "[3454.66-3455.04] SPEAKER_10: All right.",
      "[3455.56-3456.28] SPEAKER_10: Moving on.",
      "[3456.3-3459.36] SPEAKER_10: Uh, they, we're going to move on to unanimous consent.",
      "[3459.76-3470.06] SPEAKER_10: Uh, there are three items on the unanimous consent agenda listed under section 16 actions A through C. Those items are the security operations budget transfer.",
      "[3470.27-3477.69] SPEAKER_10: The 2025-2028 Title VI Program Update, and the Allied Universal Security Services Contract Extension for one year.",
      "[3477.71-3485.53] SPEAKER_10: I do understand that Director Banker would like to offer some amendments to Item B, the 2025-2028 Title VI Program Update.",
      "[3485.95-3491.24] SPEAKER_10: And such I will remove, I will move that to a recommended actions, actions, excuse me.",
      "[3491.82-3500.73] SPEAKER_10: If anyone else has a change to discussion on or questions about any of the remaining unanimous consent items, please feel free to advise the chair at this time.",
      "[3501.11-3506.66] SPEAKER_10: And I'll of course be happy to pull the item from unanimous consent for consideration under recommended action.",
      "[3507.76-3508.5] SPEAKER_10: Director Nicholson.",
      "[3510.72-3513.48] SPEAKER_02: The Allied Universal Security Contract, please pull that."
    ],
    "pre": [
      "[2019.69-2021.08] SPEAKER_17: And thank you.",
      "[2022.28-2023.14] SPEAKER_08: Thank you, Director Ruscha.",
      "[2023.32-2024.05] SPEAKER_08: Director Nicholson."
    ],
    "post": [
      "[3514.09-3514.18] SPEAKER: Okay.",
      "[3514.54-3520.38] SPEAKER_10: So item B will be removed and placed into recommended action.",
      "[3521.44-3527.77] SPEAKER_10: Excuse me, former item C, as I look in real time here, the Allied Universal Security.",
      "[3527.97-3531.64] SPEAKER_10: Are we okay with security operations, budget transfer?",
      "[3536.08-3540.51] SPEAKER_13: I would move to approve the remainder of the unanimous consent agenda."
    ]
  },
  {
    "start": 3510.72,
    "end": 6275.39,
    "text": [
      "[3510.72-3513.48] SPEAKER_02: The Allied Universal Security Contract, please pull that.",
      "[3514.09-3514.18] SPEAKER: Okay.",
      "[3514.54-3520.38] SPEAKER_10: So item B will be removed and placed into recommended action.",
      "[3521.44-3527.77] SPEAKER_10: Excuse me, former item C, as I look in real time here, the Allied Universal Security.",
      "[3527.97-3531.64] SPEAKER_10: Are we okay with security operations, budget transfer?",
      "[3536.08-3540.51] SPEAKER_13: I would move to approve the remainder of the unanimous consent agenda.",
      "[3540.89-3541.51] SPEAKER_13: Second.",
      "[3541.67-3544.64] SPEAKER_10: Okay, I have Whitmore and then Roush as the second.",
      "[3545.64-3566.08] SPEAKER_10: Okay, so this is item A for the Board of Directors to approve a budget transfer of $3,845,437.10 between Operated Expenses Lines for Transit Security Services.",
      "[3568.64-3571.22] SPEAKER_10: Is there any no votes on that?",
      "[3573.55-3573.85] SPEAKER_10: Okay.",
      "[3575.47-3577.95] SPEAKER_10: Seeing none, that item will pass 14-0-1.",
      "[3577.97-3584.6] SPEAKER_10: All right, now we're moving on to our recommended action items.",
      "[3585.36-3591.47] SPEAKER_10: And we're gonna have first on our list, the Allied Universal Security Surface Contract Extension for one year.",
      "[3591.51-3594.3] SPEAKER_10: Is there a motion?",
      "[3595.3-3595.7] SPEAKER_10: So moved.",
      "[3596.12-3596.74] SPEAKER_10: Okay, Nicholson.",
      "[3598.14-3598.58] SPEAKER_10: In a second.",
      "[3599.64-3600.08] SPEAKER_10: And Russia.",
      "[3601.8-3602.04] SPEAKER_10: All right.",
      "[3602.22-3602.94] SPEAKER_10: Any discussion.",
      "[3604.12-3604.72] SPEAKER_10: Director Nicholson.",
      "[3605.38-3605.56] SPEAKER_02: Yeah.",
      "[3605.58-3608.97] SPEAKER_02: So I just have a quick question about this one that came from a constituent.",
      "[3610.57-3617.76] SPEAKER_02: How many people do we have working from working on our security side from Allied?",
      "[3618.26-3622.91] SPEAKER_02: And how many do we have from, you know, RTDPD right now?",
      "[3623.73-3624.01] SPEAKER_02: Thank you.",
      "[3625.25-3625.39] SPEAKER_10: Ms.",
      "[3625.41-3625.73] SPEAKER_10: Johnson.",
      "[3626.33-3629.76] SPEAKER_16: Yes, I will yield the floor to Chief Martin Gano who can address that question.",
      "[3629.8-3630.15] SPEAKER_16: Thank you.",
      "[3632.74-3633.46] SPEAKER_10: Chief Martin Gano.",
      "[3634.53-3637.48] SPEAKER_22: I am trying to figure out whether we're going to be hot chat for me.",
      "[3638.32-3638.68] SPEAKER_22: Yes.",
      "[3638.7-3638.92] SPEAKER_22: Yeah.",
      "[3638.94-3644.21] SPEAKER_22: So technically, in regards to how many ally personnel, it's an hourly contract.",
      "[3644.55-3647.52] SPEAKER_22: So you'd have to take the amount of the hours and obviously divided by 40.",
      "[3648.18-3651.85] SPEAKER_22: It roughly equates to the recommended action for next year.",
      "[3651.87-3653.81] SPEAKER_22: I think it's about 9100 hours.",
      "[3653.87-3657.0] SPEAKER_22: So roughly equates about 180 security officers.",
      "[3656.98-3662.71] SPEAKER_22: Right now we currently have 87 on our staff in regards to post certified police officers.",
      "[3663.05-3668.45] SPEAKER_22: We have a couple in training and one in the academy who should be probably about 90 by the end of next month.",
      "[3669.95-3670.8] SPEAKER_02: Thank you, secretary.",
      "[3673.76-3675.2] SPEAKER_02: This is for GMCO Johnson.",
      "[3676.02-3678.77] SPEAKER_02: What are there any.",
      "[3680.25-3684.84] SPEAKER_02: plans in place or is and please feel free to not answer this as we can't.",
      "[3685.96-3692.07] SPEAKER_02: But I know there's been a drawdown over the last few years in our reliance on allied security.",
      "[3692.11-3698.88] SPEAKER_02: Is there anything in this contract or in your planning around this contract or.",
      "[3698.86-3713.82] SPEAKER_02: anything that can give us guidance on whether we expect that to continue after authorizing this, or are we expecting to stay at, you know, 90, 90 something hundred or 180 people over the next few years?",
      "[3714.84-3715.08] SPEAKER_02: Yes.",
      "[3715.52-3716.81] SPEAKER_16: Thank you very much for the question.",
      "[3716.95-3720.97] SPEAKER_16: As chief indicated, this is a contract extension and there's hours that are specified.",
      "[3721.07-3726.44] SPEAKER_16: Hence, in reference to the dollar amount that we have here, I would have to come back to the board.",
      "[3726.82-3732.63] SPEAKER_16: as it relates to any type of authorization as we're doing now currently with this contract extension, if that were to be modified.",
      "[3732.87-3750.2] SPEAKER_16: So on this point in time, it would stay the same unless there's some extenuating circumstances whereby we go out for a solicitation and we're not able to ensure that we're meeting the timeline before, since that's why we're here now with the contract extension quite naturally in doing so.",
      "[3750.28-3754.06] SPEAKER_16: We have to ensure that we have the appropriate staffing levels.",
      "[3754.4-3759.58] SPEAKER_16: So, I'm talking around and around in circles right now, but the answer would be no at this point in time.",
      "[3761.16-3761.55] SPEAKER_10: Secretary.",
      "[3763.67-3764.73] SPEAKER_10: Perfect.",
      "[3765.17-3766.09] SPEAKER_10: Second Vice Chair Whitmore.",
      "[3767.17-3773.52] SPEAKER_13: So, Chief, jog my memory on our goal for the end of the year for sworn officers.",
      "[3773.6-3774.8] SPEAKER_13: It's not 90, right?",
      "[3774.82-3776.3] SPEAKER_13: It's continuing to grow.",
      "[3776.86-3777.5] SPEAKER_10: Chief Morrigano.",
      "[3777.6-3779.58] SPEAKER_22: Yeah, so we are budgeted for 150.",
      "[3780.02-3782.67] SPEAKER_22: We're still in the process of growing to those numbers.",
      "[3784.31-3790.86] SPEAKER_22: So obviously with applications, background checks, everything else, we're heading positively to that.",
      "[3790.92-3792.88] SPEAKER_22: We're putting in more in the academy here in June.",
      "[3792.94-3795.4] SPEAKER_22: We'll continue to get lateral transfers.",
      "[3795.9-3799.83] SPEAKER_22: I'm sorry, lateral applications from other agencies, officers of experience.",
      "[3799.85-3802.71] SPEAKER_22: So we're hoping to hit that 150 goal by the end of year.",
      "[3802.73-3803.23] SPEAKER_13: All right.",
      "[3803.25-3803.95] SPEAKER_13: Thank you very much.",
      "[3803.97-3806.46] SPEAKER_13: I did have the right memory up here.",
      "[3806.54-3807.44] SPEAKER_13: Thank you, Mr. Chair.",
      "[3807.49-3809.03] SPEAKER_10: Absolutely.",
      "[3809.13-3812.35] SPEAKER_10: Any further, well, any further questions or discussions on this?",
      "[3813.29-3813.85] SPEAKER_10: Yeah, Director Riesha.",
      "[3815.69-3816.03] SPEAKER_17: Thank you, sir.",
      "[3816.11-3837.27] SPEAKER_17: So I just wanted to note in the in the past upon request, the agency has provided a breakdown of how many just like our security personnel from, you know, our city to contracted and even break down in terms of with our contracted Allied Force like",
      "[3838.4-3843.99] SPEAKER_17: the ones that are authorized to have firearms versus not, and our mental health staff and stuff.",
      "[3844.01-3850.3] SPEAKER_17: So that's something that I think the agency, I'm sure the agency would be happy to provide like that breakdown chart.",
      "[3850.38-3852.24] SPEAKER_17: I think it's been a little over a year since we've had one.",
      "[3852.72-3861.25] SPEAKER_17: So I just wanted to offer that to those who are interested and just to piggyback on Secretary Nicholson's comments.",
      "[3862.43-3862.71] SPEAKER_17: Thank you.",
      "[3863.37-3864.01] SPEAKER_10: Thank you, Director.",
      "[3866.34-3866.43] SPEAKER_10: Okay.",
      "[3866.46-3867.72] SPEAKER_10: Any further comments or questions?",
      "[3869.32-3870.12] SPEAKER_10: Okay, seeing none.",
      "[3870.24-3872.16] SPEAKER_10: So I did have, thank you, Chief.",
      "[3872.96-3876.07] SPEAKER_10: I did have Nicholson as the mover and Roush as the second.",
      "[3876.57-3878.57] SPEAKER_10: Are there any no votes on this item?",
      "[3882.81-3886.74] SPEAKER_10: Okay, seeing none, the item will pass 14-0-1 absent.",
      "[3887.58-3891.87] SPEAKER_10: We are hitting our two hour mark, so we are gonna take a break for our cart employee.",
      "[3892.95-3896.15] SPEAKER_10: Let's shoot to be back here at nine o'clock.",
      "[3896.29-3897.01] SPEAKER_10: Would that be enough time?",
      "[3898.41-3898.75] SPEAKER_10: Nope.",
      "[3898.77-3899.35] SPEAKER_10: Okay.",
      "[3899.37-3899.57] SPEAKER_10: Okay.",
      "[3899.59-3900.59] SPEAKER_10: Let's do 905 then.",
      "[3901.15-3901.71] SPEAKER_07: Thank you.",
      "[3901.73-3902.68] SPEAKER_10: Thank you.",
      "[3902.7-3927.69] SPEAKER_14: We'll back at 905.",
      "[3927.94-3954.93] SPEAKER_14: We've got it.",
      "[3954.95-3955.22] SPEAKER: We've got it.",
      "[3955.24-3955.43] SPEAKER_14: All right.",
      "[3955.45-3955.74] SPEAKER_14: There are two.",
      "[3955.76-3955.96] SPEAKER_14: All right.",
      "[3957.81-3968.38] SPEAKER_14: not.",
      "[3988.99-3990.54] SPEAKER_14: Yeah.",
      "[3990.84-3991.28] SPEAKER_14: Yeah.",
      "[3991.38-4011.1] SPEAKER_14: Yeah.",
      "[4023.98-4025.04] SPEAKER: Yeah.",
      "[4025.06-4027.32] SPEAKER: Yeah.",
      "[4027.94-4047.32] SPEAKER_14: Yeah.",
      "[4065.25-4070.62] SPEAKER_14: You know what it is.",
      "[4112.0-4113.9] SPEAKER: Okay.",
      "[4114.38-4115.7] SPEAKER: But yeah.",
      "[4117.06-4119.83] SPEAKER: Yeah.",
      "[4120.45-4139.86] SPEAKER_14: I hear.",
      "[4144.7-4172.06] SPEAKER_14: We had a tower backed up on Friday night.",
      "[4172.41-4178.22] SPEAKER_14: And, uh, Senator, if you're in the hot quarter, so you know, it's not a big deal.",
      "[4178.28-4183.63] SPEAKER_14: So, but if my daughter's school, no, they're out there, like an ankle thing.",
      "[4183.77-4185.17] SPEAKER_14: I don't know.",
      "[4186.59-4187.27] SPEAKER: I don't know.",
      "[4187.41-4188.29] SPEAKER: I don't know.",
      "[4188.31-4189.78] SPEAKER: I don't know.",
      "[4189.8-4191.94] SPEAKER: I don't know.",
      "[4192.18-4193.78] SPEAKER: I don't know.",
      "[4193.96-4195.06] SPEAKER: I don't know.",
      "[4195.12-4196.19] SPEAKER: I don't know.",
      "[4196.37-4197.59] SPEAKER: I don't know.",
      "[4212.25-4217.68] SPEAKER_14: Thank you.",
      "[4219.94-4240.45] SPEAKER_14: Thank you.",
      "[4240.87-4258.96] SPEAKER_14: You do it.",
      "[4317.25-4326.72] SPEAKER_14: We're out of time.",
      "[4327.08-4334.43] SPEAKER_14: We're out of time.",
      "[4334.55-4345.8] SPEAKER_14: We're out of time",
      "[4356.53-4357.97] SPEAKER: I'm sorry.",
      "[4391.02-4418.9] SPEAKER_14: Okay.",
      "[4432.01-4452.23] SPEAKER_14: Thank you very much.",
      "[4506.64-4507.92] SPEAKER_09: Yeah, we're gonna get started.",
      "[4508.19-4511.43] SPEAKER_14: Have you seen Jack?",
      "[4546.81-4572.81] SPEAKER_14: All right, folks, we're at 906.",
      "[4573.93-4575.03] SPEAKER_10: We're going to get started.",
      "[4579.43-4580.65] SPEAKER_10: Director Bouquet, how do you vote?",
      "[4581.02-4581.54] SPEAKER_10: I mean, yes.",
      "[4585.26-4591.85] SPEAKER_10: We have a quorum of me and Director Packillary and Director Nicholson and Director Harwick.",
      "[4607.07-4607.41] SPEAKER_10: All right.",
      "[4607.58-4609.08] SPEAKER_10: Thank you everyone for your patience.",
      "[4609.48-4612.81] SPEAKER_10: We are now moving on to our next recommended action for tonight.",
      "[4614.07-4626.66] SPEAKER_10: And that is going to be the recommended action of the 2025-2028 Title VI program update to comply with federal laws, regulations, and guidelines related to Title VI of the Civil Rights Act of 1964.",
      "[4627.16-4628.69] SPEAKER_10: Do we have a motion?",
      "[4629.77-4630.29] SPEAKER_11: So moved.",
      "[4630.85-4631.91] SPEAKER_10: I have Catlin as the mover.",
      "[4632.93-4633.63] SPEAKER_10: Second, Guzman.",
      "[4633.93-4635.49] SPEAKER_10: Guzman is the second.",
      "[4636.96-4641.37] SPEAKER_10: I do understand that Director Banker has two amendments she would like to offer on this item.",
      "[4641.75-4644.27] SPEAKER_10: Director Banker will take your amendments one at a time.",
      "[4645.81-4647.78] SPEAKER_10: What is your first amendment, Director Banker?",
      "[4648.34-4649.16] SPEAKER_19: Thank you very much.",
      "[4649.86-4656.37] SPEAKER_19: And I'm glad everybody is now, you know, second wind and we're ready to go on to our",
      "[4657.24-4659.41] SPEAKER_19: I don't know, six or seventh hour of meeting.",
      "[4660.37-4663.76] SPEAKER_19: Actually, I will tell you I have three.",
      "[4663.8-4665.04] SPEAKER_19: We'll see how things go.",
      "[4665.08-4666.16] SPEAKER_19: They're short.",
      "[4667.17-4669.67] SPEAKER_19: The first one, well, let me give you a little bit of background.",
      "[4669.77-4670.64] SPEAKER_19: Okay.",
      "[4670.66-4675.71] SPEAKER_19: So the background is I met with my four cities back in February and March.",
      "[4675.69-4680.19] SPEAKER_19: And of course, you meet with them and you say hi and you say, okay, what are your needs?",
      "[4680.27-4681.09] SPEAKER_19: What are your wants?",
      "[4682.15-4691.94] SPEAKER_19: I met with all of them and they all gave me a list of basically trying to restore service that was removed during the pandemic.",
      "[4691.96-4702.53] SPEAKER_19: And so, of course, as my job as director, I'm trying to work with our staff to try to get that service restored.",
      "[4703.37-4703.97] SPEAKER_19: And so,",
      "[4705.73-4729.37] SPEAKER_19: One of my questions or issues is I am guessing that when the RTD Board had to make the hard decisions of how to cut service almost in half because of this highly unusual pandemic, perhaps some of these cuts were not done equally across all 15 districts.",
      "[4729.59-4734.77] SPEAKER_10: Director Banker, I'm sorry to interrupt, just so that we keep in order, could we get a second on?",
      "[4735.15-4736.84] SPEAKER_10: Could you read the motion and then we get a second?",
      "[4736.86-4750.38] SPEAKER_19: Yes, the motion is change the threshold for disproportionate burden and disparate impact from 10% to 20% as it relates to major service changes and consistent with the FTA circular 4702.1B.",
      "[4752.02-4758.43] SPEAKER_19: And I believe the version that will be voted on is actually the version that",
      "[4759.0-4760.84] SPEAKER_19: Mr. Kroll put up for us.",
      "[4761.92-4764.15] SPEAKER_10: So that's, that's the language right there.",
      "[4764.19-4771.52] SPEAKER_10: The first motion is to move the move to amend the 2025, 2028 title six program update, such that the threshold for triggering either.",
      "[4771.98-4780.09] SPEAKER_10: Disappointed Burton or disparate in that fine late night, finding a rising from a major service change from 10% to 20%.",
      "[4781.77-4782.59] SPEAKER_10: Do I have a second?",
      "[4783.07-4783.43] SPEAKER_10: Second.",
      "[4783.45-4785.57] SPEAKER_10: Pagliari is the second.",
      "[4786.46-4786.8] SPEAKER_19: Thank you.",
      "[4787.64-4794.12] SPEAKER_19: So just to continue a little bit more background and then we can start, I guess, the debate here.",
      "[4795.07-4802.11] SPEAKER_19: I'm just trying to get service restored that was eliminated during the pandemic.",
      "[4802.94-4817.48] SPEAKER_19: And there have been a couple of times now when I have requested and the answer that I have gotten several times is, well, it's going to depend on how the equity analysis calculations come out.",
      "[4817.45-4832.29] SPEAKER_19: I'm just trying to find ways where we can perhaps start to restore some of the service that had been eliminated during the pandemic and perhaps do it a little bit quicker and",
      "[4833.6-4837.79] SPEAKER_19: and also try to make it not quite so difficult.",
      "[4838.22-4849.54] SPEAKER_19: So then what happened, of course, is everyone received about a week, 10 days ago, a letter from the city and county of Broomfield, and their transportation staff went through",
      "[4849.52-4857.47] SPEAKER_19: our items quite closely and they sent us all a letter with recommended changes.",
      "[4858.21-4868.02] SPEAKER_19: So I've gone through with their changes and that's where I've come up with the three amendments that I'd like to at least talk to the board, see what your thoughts are.",
      "[4868.64-4871.23] SPEAKER_19: You know, hopefully it'll pass, but we'll see what happens.",
      "[4871.67-4877.53] SPEAKER_19: But it's just basically what City and County of Broomfield had found when they did their research is that",
      "[4877.51-4886.84] SPEAKER_19: the RTD is using some very conservative calculations compared to some of the other large transit agencies.",
      "[4887.52-4892.99] SPEAKER_19: And so I did send you also a copy of the city and county of Broomfields letter just to refresh your memory.",
      "[4893.99-4901.16] SPEAKER_19: And so I would like to put forth that the first amendment would be changing the threshold from 10% to 20%.",
      "[4901.18-4902.66] SPEAKER_10: Thank you, Treasurer Baker.",
      "[4902.8-4905.65] SPEAKER_10: So again, the discussion right now is on the motion",
      "[4906.32-4908.64] SPEAKER_10: This first motion, the first amendment.",
      "[4908.98-4909.81] SPEAKER_10: Director Catlin.",
      "[4913.41-4914.31] SPEAKER_11: Thank you, Mr. Chair.",
      "[4914.93-4917.76] SPEAKER_11: I'd like to ask GM CEO Johnson.",
      "[4918.54-4931.42] SPEAKER_11: I heard from someone I don't remember now because it's getting late, but someone said that some of those assumptions made by City and County Broomfield were incorrect.",
      "[4931.48-4931.62] SPEAKER_10: Ms.",
      "[4931.66-4932.02] SPEAKER_10: Johnson.",
      "[4932.31-4933.43] SPEAKER_16: Yes, thank you very much.",
      "[4934.13-4952.61] SPEAKER_16: Relative to the comments that were made, and thank you very much, Director Catlin, as it relates to the transit agencies that were mentioned being part of the Metropolitan Atlanta Rapid Transit Authority, Los Angeles County Metropolitan Transit Authority, King County Metro, which is in Greater Seattle and then Chicago Transit Authority.",
      "[4954.39-4959.19] SPEAKER_16: That information, especially coming from LA Metro as the former Chief Operations Officer there,",
      "[4959.66-4963.02] SPEAKER_16: This is not correct relative to where we sit.",
      "[4963.48-4970.93] SPEAKER_16: And more specifically, I do know our director of civil rights when we were going through this quite naturally in the role that he is in.",
      "[4970.99-4976.02] SPEAKER_16: He and his team did a desk audit and worked with colleagues at different transit agencies.",
      "[4976.04-4981.36] SPEAKER_16: So that's the communique that I did disseminate yesterday upon receiving this information.",
      "[4981.6-4986.21] SPEAKER_16: So Mr. Green, if you want to just expound succinctly and briefly.",
      "[4986.66-4992.25] SPEAKER_01: Yes, thank you so much, General Manager and CEO Johnson, to expand upon the response.",
      "[4992.29-5001.74] SPEAKER_01: I just also want to ground us in first state that it is our collective responsibility to make federally compliant and equitable decisions, especially as it relates to service changes.",
      "[5002.38-5009.53] SPEAKER_01: And in doing that audit, we looked at 22, rather 23 different organizations, which includes the four.",
      "[5009.51-5013.69] SPEAKER_01: Marta, LA Metro, King County, and the Chicago Transit Authority.",
      "[5014.23-5025.43] SPEAKER_01: And I would say the way to look at the disparate impact or disproportionate burden, the framing of it is how sensitive or less sensitive versus more sensitive, right?",
      "[5025.63-5027.57] SPEAKER_01: And ours is stacked in the middle.",
      "[5027.61-5029.53] SPEAKER_01: So I want to give you some numbers here.",
      "[5030.29-5032.82] SPEAKER_01: So for the four that I just mentioned,",
      "[5033.91-5042.6] SPEAKER_01: Marta has 10%, LA Metro has 5%, King County has 10%, CTA or Chicago Transit Authority has 15%.",
      "[5043.62-5054.64] SPEAKER_01: And then when we rack and stack, look at those 22 different organizations, six out of that 23 have 5% or less, two have 8%,",
      "[5054.97-5063.93] SPEAKER_01: six, which includes us, or seven, including us, is at 10%, three at 15%, and then three at 20%.",
      "[5064.15-5070.8] SPEAKER_01: And in my over eight years of doing this work, and I'll just say that",
      "[5070.78-5082.88] SPEAKER_01: When you are setting your policy, you don't want to do a disservice to the spirit and the letter of what we're ultimately trying to achieve, specifically with Title VI.",
      "[5083.46-5089.11] SPEAKER_01: Title VI is not a stopping mechanism of bringing back or restoring service.",
      "[5089.82-5097.15] SPEAKER_01: There are a lot of different variables, as I mentioned before, with respect to our service development guidelines, our operators resources, so on and so forth.",
      "[5097.67-5109.14] SPEAKER_01: This is just a mechanism for the agency, such as RTD and the board of directors, so we don't get too far over our skis without discounting populations that are more likely to be transit reliant.",
      "[5109.16-5117.33] SPEAKER_01: So again, it's not a stopping mechanism, but this is just more so to make sure that we are taking into consideration all of our customers.",
      "[5119.35-5121.71] SPEAKER_08: I've director Ruchin next.",
      "[5126.58-5131.23] SPEAKER_17: Um, I did have a question, but I also, um, treasure banker had her hand up and it was her motion.",
      "[5131.33-5133.61] SPEAKER_17: So I'm happy to, to wait if that was in response.",
      "[5134.39-5134.97] SPEAKER_08: Treasure banker.",
      "[5136.34-5142.26] SPEAKER_19: Um, I, I feel that we are in an extremely unique situation because of the pandemic.",
      "[5143.23-5146.47] SPEAKER_19: So how can we restore",
      "[5147.75-5152.4] SPEAKER_19: let's say 40% of the service that had been cut several years ago.",
      "[5152.84-5160.65] SPEAKER_19: How can we get back to 2019 when my district, other districts had that service?",
      "[5161.54-5164.66] SPEAKER_19: And so now we're being told",
      "[5164.64-5173.77] SPEAKER_19: that we can't get that service back because of this conservative calculation that we're doing, but we used to have it.",
      "[5174.93-5182.06] SPEAKER_19: And so how do we get from where we are now to bringing service back to pre-pandemic levels?",
      "[5183.4-5183.56] SPEAKER_08: Ms.",
      "[5183.58-5183.96] SPEAKER_08: Johnson.",
      "[5184.26-5185.89] SPEAKER_16: Yes, thank you very much, Director Banker.",
      "[5185.93-5187.51] SPEAKER_16: That question is better suited for me.",
      "[5187.55-5191.81] SPEAKER_16: Relative to the service delivery framework that we have,",
      "[5192.1-5210.8] SPEAKER_16: While Title VI plays a role relative to major service changes as we talk about how we deploy service is based upon a myriad of different factors relative to our revenue service hours, but more specifically at how we use our comprehensive operational analysis specifically as we talk about the SOP.",
      "[5211.44-5217.67] SPEAKER_16: When I came into this organization, it was decided that we were going to look at 85% of what service levels were.",
      "[5218.32-5220.78] SPEAKER_16: 85% of what service levels were in 2019.",
      "[5221.55-5230.72] SPEAKER_16: We were in a different time relative to the commuting patterns, relative to how people were working going forward.",
      "[5231.78-5236.97] SPEAKER_16: What I will share is that we are being very diligent and judicious",
      "[5237.39-5241.8] SPEAKER_16: and how we're applying service because we do want to ensure there's equity.",
      "[5241.84-5248.37] SPEAKER_16: I'm going to speak a little bit out of school here because I shared this with you yesterday, but I'll say it in this context as well.",
      "[5248.81-5259.33] SPEAKER_16: As we talk about Longmont and we talk about service, we are looking at that for the fall service change.",
      "[5259.66-5282.41] SPEAKER_16: That is up to the board quite naturally, but I did want to put that forward because with the restoration of service keeping in mind that all transit agencies across, you know, the US were in these precarious positions and the Federal Transit Administration more or less provided waivers, waivers from the sense of how we were decreasing service due to the fact that we didn't have enough people power.",
      "[5283.14-5288.48] SPEAKER_16: Also, we currently are still working under a waiver as it relates to our spare ratio.",
      "[5288.59-5298.58] SPEAKER_16: What I mean by that is when you deploy service in the mornings and the afternoons with the peak, you have a certain pullout rate and you're only supposed to have a 20% spare ratio.",
      "[5298.92-5306.25] SPEAKER_16: We've deviated from that and have a waiver and we're right sizing the fleet as we move forward.",
      "[5306.29-5312.32] SPEAKER_16: So while you're bringing up these points, as you indicated, we are in uncharted territory or were.",
      "[5312.5-5313.94] SPEAKER_16: And we're coming back from that.",
      "[5314.92-5327.19] SPEAKER_16: We are looking at where there are needs relative to the entire area from an origin and destination vantage point just by virtue of how our service area is going forward.",
      "[5327.69-5331.03] SPEAKER_16: So I'm not providing this to say I don't.",
      "[5331.01-5333.25] SPEAKER_16: understand what you're trying to do.",
      "[5333.27-5338.96] SPEAKER_16: And as I share it with you, I do clearly and we want to work within the frameworks that we have.",
      "[5339.6-5345.43] SPEAKER_16: But a whole cell of restoration of what was happening in 2019, that wouldn't be fiscally responsible.",
      "[5345.51-5353.58] SPEAKER_16: And I say it from the vantage point of, we had a lot of service that was out on the street, maybe that yielded one passenger boarding per hour.",
      "[5354.03-5355.55] SPEAKER_16: but that was out on the street.",
      "[5355.85-5359.32] SPEAKER_16: Does that really yield the return on investment going forward?",
      "[5359.42-5366.97] SPEAKER_16: Hence, that's why there were modifications relative to reallocation of services going forward.",
      "[5367.39-5368.85] SPEAKER_19: Okay, but if I can.",
      "[5368.99-5370.93] SPEAKER_19: Treasure, yeah.",
      "[5371.01-5375.02] SPEAKER_19: Some of the issues that you just raised are important.",
      "[5375.19-5375.82] SPEAKER_19: There's no doubt.",
      "[5376.16-5380.42] SPEAKER_19: However, I don't believe it goes to the equity calculation.",
      "[5382.88-5383.02] SPEAKER_19: I",
      "[5385.08-5400.76] SPEAKER_19: What I think is important to to hear from staff and I know we're going to be talking about this in our retreat, which is I'm looking forward to that is if it's possible for us to go back to over 100 million riders in three years.",
      "[5401.43-5420.99] SPEAKER_19: what barriers are we facing to try to do that so that we can go from 65 million to 100, 106, 110, and start quickly, or not quickly, but faster than what we're doing now to get back up to higher service levels.",
      "[5422.96-5423.12] SPEAKER_16: Ms.",
      "[5423.16-5423.5] SPEAKER_16: Johnson.",
      "[5423.78-5424.18] SPEAKER_16: Thank you.",
      "[5424.2-5427.64] SPEAKER_16: There's a couple of external factors that play into that.",
      "[5427.99-5434.93] SPEAKER_16: quite naturally when we look at the central business district and the occupancy rate and the lack of people commuting in.",
      "[5435.43-5447.31] SPEAKER_16: It's important to keep in mind that there was, I'm forgetting the name, but the city and county of Denver did the report relative to the usage rate in looking at the occupancy levels.",
      "[5447.57-5451.54] SPEAKER_16: But more specifically, what's important to note is that",
      "[5451.52-5456.73] SPEAKER_16: there hasn't been the level of bounce back relative to this central business district.",
      "[5457.95-5468.39] SPEAKER_16: I believe the last time I looked at stats, city and county at Denver was in the bottom three out of out of 50 major cities.",
      "[5468.83-5472.49] SPEAKER_16: And then as we know, the state of Colorado is the number",
      "[5474.08-5478.92] SPEAKER_16: is the third state relative to remote work and then City of Boulder is number one.",
      "[5479.34-5487.09] SPEAKER_16: While I factor that in, we don't have the same operating environment that we did in 2019 or prior to the pandemic.",
      "[5487.45-5496.88] SPEAKER_16: How do we get back to the transit usage that we had before?",
      "[5497.56-5501.49] SPEAKER_16: I think there's so many extenuating factors going forward",
      "[5501.84-5525.37] SPEAKER_16: relative to how we're delivering the service, but also having the vehicle capacity, the people power, and the reliability aspect, which bring us full circle to state of good repair and the other aspects that have caused people to shy away from utilizing our network because we were sacrificing one element for something else relative to delivery.",
      "[5525.89-5528.96] SPEAKER_16: And I bring that up because as we talk about the people power,",
      "[5529.26-5553.59] SPEAKER_16: we clearly saw that our operating workforce was decreasing in 2016 as it was across the country, but more specifically, having other ancillary services that were readily available where people whereby were working extra shifts and then we didn't have enough people for daily pullout on those other routes.",
      "[5554.01-5557.61] SPEAKER_16: And so I'm providing that context to say",
      "[5557.93-5577.93] SPEAKER_16: to get back, there are certain things that the agency can surely do, but to get back to those numbers within the period of time that you specify would be very challenging just because of the different operating characteristics that have been altered by factors that are no fault of this agency's.",
      "[5580.02-5580.44] SPEAKER_17: Thanks, sir.",
      "[5580.48-5583.86] SPEAKER_17: So I have a question for legal.",
      "[5585.28-5595.48] SPEAKER_17: So recognizing this has to be submitted shortly, I want to be careful of my words.",
      "[5597.3-5608.19] SPEAKER_17: Can we make significant changes at this juncture after all of the public comment process or",
      "[5608.74-5613.91] SPEAKER_17: Is that something that we, I guess, I don't know if it's a yes, no, or a gray area.",
      "[5613.99-5616.13] SPEAKER_17: And I wanted to get a bit of feedback on that.",
      "[5616.59-5621.22] SPEAKER_17: Now, to disparage the motion, I just also want to understand the potential legal implications.",
      "[5626.32-5628.69] SPEAKER_16: I will address that question.",
      "[5629.23-5631.89] SPEAKER_16: And then I'll ask Mr. Green to expound.",
      "[5631.99-5635.03] SPEAKER_16: I think if anything, as we talk about public engagement,",
      "[5635.61-5659.39] SPEAKER_16: and talk about the agencies, the perception of the agency being trustworthy, going forward and getting public engagement quite naturally and then not leveraging it for the betterment of the constituencies that we serve, I think pose a risk as it relates to the agency in reference of public perception.",
      "[5659.85-5665.78] SPEAKER_16: There is leeway relative to the circular in light of what can be done.",
      "[5665.86-5678.94] SPEAKER_16: We are sitting here on May 28th, recognizing that we have a new administration and that we do need to have a Title VI program that's submitted and we have been engaged on this topic since January.",
      "[5679.41-5682.03] SPEAKER_16: That's not to negate any amendments or anything like that.",
      "[5682.11-5684.61] SPEAKER_16: I am just trying to answer the question.",
      "[5684.8-5691.97] SPEAKER_16: But more specifically, Mr. Green, since you are very well-versed in 4702.1B, I would yield the floor to you.",
      "[5692.02-5696.07] SPEAKER_16: And that's the citation for the FTA circular that we're talking about.",
      "[5696.51-5696.69] SPEAKER_01: Yes.",
      "[5696.75-5698.87] SPEAKER_01: Thank you so much, GM CEO Johnson.",
      "[5698.93-5700.13] SPEAKER_01: You.",
      "[5704.54-5706.94] SPEAKER_01: Apology, the positive microphone.",
      "[5707.22-5707.52] SPEAKER_01: Yes.",
      "[5707.88-5708.32] SPEAKER_01: Apologies.",
      "[5708.38-5712.31] SPEAKER_01: But to piggyback off what GM CEO Johnson has noted,",
      "[5713.33-5720.37] SPEAKER_01: That is, I would couch that as the bigger risk is when we think about establishing policy, right?",
      "[5720.43-5725.05] SPEAKER_01: As it relates to 4702.1B, the FTA Title VI circular.",
      "[5725.43-5734.85] SPEAKER_01: it does call upon the agency to do a lot of outreach and public involvement to ensure that we are collecting that feedback to inform decisions.",
      "[5735.41-5748.79] SPEAKER_01: So at the ground level, if we think about public involvement in Title VI, it's part and parcel of what the Title VI program stands for, ensuring that folks in the community are able to inform the decision, such as the policy.",
      "[5749.49-5753.62] SPEAKER_01: So, but with respect to the circular, we can, i.e.",
      "[5753.94-5757.89] SPEAKER_01: the board of directors could adopt a different threshold.",
      "[5757.9-5771.0] SPEAKER_01: So for example, the one that director banker has put forth, although we received a lot of feedback indicating the 25% threshold and 36 month cumulative change, et cetera, all that's packaged in within the proposed update.",
      "[5771.76-5779.03] SPEAKER_01: There is an exception to that within the circular where it states where the board is ultimately approving the policy.",
      "[5780.92-5781.32] SPEAKER_01: Thank you.",
      "[5782.18-5786.09] SPEAKER_10: Director Gysinger and then Director Larson.",
      "[5789.69-5791.21] SPEAKER_10: Director Larson and then Harwick.",
      "[5793.4-5793.82] SPEAKER_06: Thank you.",
      "[5795.38-5810.4] SPEAKER_06: I guess my question is, I looked through a lot of the Title VI updates that were for service changes, this Title VI analysis that were in the",
      "[5810.58-5833.1] SPEAKER_06: the board packet, and it seemed like most of the time we, you know, sometimes there was a little bit of disparate impact on one route or the other, but mostly it sort of ended up that in the aggregate there wasn't really much, and there were legitimate justifications for what there was on an individual basis.",
      "[5833.9-5838.04] SPEAKER_06: I guess my, you know, my basic question is with",
      "[5838.39-5846.48] SPEAKER_06: with regard to this update and the changes that we're proposing, are we just, I mean, is there really a problem here?",
      "[5846.5-5848.68] SPEAKER_06: Are we just making this harder for ourselves?",
      "[5848.74-5859.87] SPEAKER_06: Because it doesn't seem like we're trying to generally start out making service changes with an intention of causing disparate impact one place or the other.",
      "[5859.93-5863.72] SPEAKER_06: We make them, I guess, for a variety of reasons.",
      "[5864.68-5868.18] SPEAKER_06: And on balance, they don't really seem to",
      "[5868.78-5881.67] SPEAKER_06: under our current setup, you know, ever, ever sort of look like they were, you know, there were somehow some, you know, bad intent or just inattention to who we're serving.",
      "[5881.73-5887.84] SPEAKER_06: It seems like we do a lot of analysis and then basically do what we would have done anyways.",
      "[5888.21-5908.97] SPEAKER_06: Why put sort of a greater burden, sort of regulate ourselves more than we have to, and why not just give us the freedom to operate as we would as much as we can, given that we don't, you know, it doesn't necessarily seem like it's been a problem for a long time, at least from what I could see.",
      "[5909.01-5917.4] SPEAKER_06: I mean, there weren't that many Title VI complaints that I could, that I, in the information that was provided.",
      "[5917.87-5918.26] SPEAKER_06: I don't know.",
      "[5919.44-5922.54] SPEAKER_06: My basic question is why would we make things harder for ourselves?",
      "[5922.9-5923.14] SPEAKER_06: Thanks.",
      "[5924.91-5925.79] SPEAKER_10: Thank you, Ms.",
      "[5925.83-5926.31] SPEAKER_10: Johnson.",
      "[5927.78-5928.4] SPEAKER_16: Thank you very much.",
      "[5928.46-5945.3] SPEAKER_16: The one thing I would share Director Larson, as we look at the modification that's been put forward for your consideration, like a 36 month period, as we're adding back service, there could be unforeseen consequences as we do them in a segmented fashion.",
      "[5945.62-5955.19] SPEAKER_16: And so that's one element as a whole, because if we're making modifications going forward, there could be an adverse impact.",
      "[5955.49-5957.91] SPEAKER_16: And so that's what I would showcase there.",
      "[5958.69-5970.73] SPEAKER_16: Keeping in mind to the point that you raised, when we talk about the aspect of DIDB, it's what can we do as an agency to help mitigate that to your point going forward.",
      "[5970.95-5980.3] SPEAKER_16: But it's just to ensure that we have a program whereby we are not causing undue harm to certain population segments.",
      "[5982.76-5983.28] SPEAKER_08: Director Larson.",
      "[5985.31-5993.22] SPEAKER_06: But it just seems like when I was reading the documents that there, we, there's always a legitimate to justification for, for everything we want to do.",
      "[5993.23-6001.12] SPEAKER_06: Or we, you know, it's always, there's always this, we'll have a disparate impact, but we have a legitimate justification for, for doing this.",
      "[6001.2-6002.43] SPEAKER_06: So we're, we're just going to do it.",
      "[6002.97-6011.95] SPEAKER_06: I mean, how many times, how many times in the last however many years has it been that we did this analysis, we looked at all the service changes we wanted to do.",
      "[6012.32-6016.77] SPEAKER_06: And we were like, okay, no, we're not going to do this list of service changes.",
      "[6016.81-6023.04] SPEAKER_06: We're going to, you know, cross out these ones because the aggregate impact is too much.",
      "[6023.64-6025.84] SPEAKER_06: I mean, is it, is it, is that happened?",
      "[6026.04-6032.73] SPEAKER_06: I just didn't, from what I read in the packet, I didn't, I don't know if I caught everything, but it didn't seem like there were a lot of those.",
      "[6032.99-6041.81] SPEAKER_06: Or is this happening kind of at an earlier stage where when Bob in service says, let's just send a bunch of buses to Cherry Hills Village, somebody says, no, no.",
      "[6042.04-6046.36] SPEAKER_06: That's not going to work out before it even gets to this point.",
      "[6047.57-6047.85] SPEAKER_06: You know?",
      "[6050.27-6050.75] SPEAKER_16: I'm sorry.",
      "[6051.49-6052.49] SPEAKER_16: Thank you for the question.",
      "[6052.53-6053.61] SPEAKER_16: It's for me.",
      "[6053.75-6059.18] SPEAKER_16: I've only been here for five years and I came in the height of the pandemic and we've been adding back service and not.",
      "[6059.56-6069.65] SPEAKER_16: So that's difficult for me to answer just because we have not been in a situation whereby",
      "[6070.36-6071.46] SPEAKER_16: It's been the opposite.",
      "[6072.12-6074.4] SPEAKER_16: Carl, do you have anything to add?",
      "[6075.0-6075.4] SPEAKER_01: Yeah.",
      "[6075.43-6076.93] SPEAKER_01: I would just highlight chair bouquet.",
      "[6076.95-6094.15] SPEAKER_01: If I may, since January 2023, there was about 270 service change recommendations that have been implemented and roughly 26, 24, 26 of those 276 were considered major service changes.",
      "[6094.66-6101.61] SPEAKER_01: And out of that 26 to director Larson's point, there has been 13 potential disparate impacts.",
      "[6102.45-6106.56] SPEAKER_01: And to your point, there was a substantial legitimate justification.",
      "[6106.57-6116.63] SPEAKER_01: And going it's, I wouldn't necessarily couch it as an exercise, but I would say we were the transit equity office within within the civil rights division.",
      "[6116.88-6121.41] SPEAKER_01: works hand in glove with Jesse Carter and his team service development.",
      "[6122.18-6129.86] SPEAKER_01: And as we are having those conversations after the service change recommendation are put forth and we analyze it if there is a potential disparate impact.",
      "[6130.21-6135.92] SPEAKER_01: More often than not, to your point, and to my earlier, earlier point, that Title VI is not a stopping mechanism.",
      "[6136.44-6147.2] SPEAKER_01: And I wouldn't necessarily state that it's burdensome because it's one of our responsibilities to make sure that we are equitably distributing services across our service area.",
      "[6147.86-6155.38] SPEAKER_01: But more often not, there is a legitimate justification to put forth the service recommendation as it is presented to the board.",
      "[6158.07-6158.47] SPEAKER_10: Thank you.",
      "[6159.58-6159.84] SPEAKER_10: Director.",
      "[6162.02-6162.12] SPEAKER_10: Okay.",
      "[6162.14-6168.52] SPEAKER_10: Uh, I had director Harwick and just as a reminder, we're currently in discussion regarding this first motion.",
      "[6168.6-6173.04] SPEAKER_10: Just want to make sure that, um, first amendment, excuse me, first amendment.",
      "[6173.06-6176.57] SPEAKER_10: So make sure, uh, comments are around that.",
      "[6177.03-6177.63] SPEAKER_10: Director Harwick.",
      "[6179.37-6190.03] SPEAKER_04: Mine will be comments about this, but also moving forward as well, because I am in support of this, this title six, not, not the amendment, just as just a straight title six.",
      "[6190.05-6195.74] SPEAKER_04: Um, you know, I, I don't think moving, uh, from, from 10 or from.",
      "[6195.72-6201.03] SPEAKER_04: from 10% to 20% is going to increase ridership.",
      "[6201.25-6211.44] SPEAKER_04: I think that right now it allows our staff the ability to really center equity and effectively protect our communities.",
      "[6211.52-6218.27] SPEAKER_04: And while I get that Broomfield feels like they want more service, I don't think this is going to get it there.",
      "[6218.91-6223.93] SPEAKER_04: I think this is the 11th hour and I think that it's really imperative that our staff has worked extremely hard on this.",
      "[6223.95-6229.39] SPEAKER_04: They've had to jump through a whole variety of hoops.",
      "[6230.1-6255.29] SPEAKER_04: bunch of different board members and I think that we're here, they've done an incredible job and I think that this is, they are the subject matter experts and it's our opportunity here to put our trust in them, our belief in them and I think that we owe them that and we have been talking about this since January so we're well into four months and I think that it is key that we support this",
      "[6255.27-6264.21] SPEAKER_04: Title six as is and we allow them to move forward and we allow them to start you know handing us off to the feds and we can move forward and That's where I'm at.",
      "[6264.33-6264.61] SPEAKER_04: Thank you.",
      "[6264.97-6274.95] SPEAKER_10: Thank you director any further conversation on this amendment Secretary Nicholson So this is for our deputy general counsel"
    ],
    "pre": [
      "[3501.11-3506.66] SPEAKER_10: And I'll of course be happy to pull the item from unanimous consent for consideration under recommended action.",
      "[3507.76-3508.5] SPEAKER_10: Director Nicholson."
    ],
    "post": [
      "[6275.39-6287.54] SPEAKER_02: If we were to pass this tonight, what's the legal risk to the agency when it comes to our federal Title VI approval as a result of this change?",
      "[6287.7-6300.1] SPEAKER_02: Like, is this gonna have any, would this have any legal repercussions or could we just, do we feel pretty comfortable that we could do this and not have the federal government take issue with it?",
      "[6301.48-6303.39] SPEAKER_10: In regards to the amendment secretary?",
      "[6303.4-6303.51] SPEAKER: Yeah."
    ]
  },
  {
    "start": 6275.39,
    "end": 6795.93,
    "text": [
      "[6275.39-6287.54] SPEAKER_02: If we were to pass this tonight, what's the legal risk to the agency when it comes to our federal Title VI approval as a result of this change?",
      "[6287.7-6300.1] SPEAKER_02: Like, is this gonna have any, would this have any legal repercussions or could we just, do we feel pretty comfortable that we could do this and not have the federal government take issue with it?",
      "[6301.48-6303.39] SPEAKER_10: In regards to the amendment secretary?",
      "[6303.4-6303.51] SPEAKER: Yeah.",
      "[6306.91-6307.49] SPEAKER_10: deputy counsel.",
      "[6311.41-6311.76] SPEAKER_12: There we go.",
      "[6311.77-6312.26] SPEAKER_12: Excuse me.",
      "[6312.82-6314.18] SPEAKER_12: Uh, thank you, director Nicholson.",
      "[6314.74-6316.02] SPEAKER_12: Um, I, I don't have concerns.",
      "[6318.92-6319.32] SPEAKER_08: Secretary.",
      "[6321.16-6321.73] SPEAKER_08: That is all.",
      "[6322.81-6323.91] SPEAKER_08: Uh, yeah, treasure banker.",
      "[6325.39-6333.36] SPEAKER_19: Um, here is where I do not understand in 2019.",
      "[6335.72-6337.2] SPEAKER_19: We had the service.",
      "[6338.51-6342.9] SPEAKER_19: My area, my district as many others have grown.",
      "[6342.96-6346.01] SPEAKER_19: There's no",
      "[6347.21-6355.28] SPEAKER_19: For example, the town of Erie, just a few years ago was 20,000, now it's 40,000, like two, three years later.",
      "[6355.3-6363.35] SPEAKER_19: And when I met with Erie, they said, hey, we're planning going to 80,000 in just the next couple of years.",
      "[6364.09-6374.72] SPEAKER_19: I also read in the Denver Post that the town of Erie is the 15th fastest city in the country in terms of population growth.",
      "[6375.73-6391.32] SPEAKER_19: So my question is, is if we had the service prior to the pandemic and it was serving all of these communities, why is it so difficult to get that restored?",
      "[6395.47-6396.09] SPEAKER_10: Just Johnson.",
      "[6399.77-6402.39] SPEAKER_16: So thank you, Director Banker.",
      "[6404.67-6424.81] SPEAKER_16: This, what I'm going to say goes back to the previous comments that I had before, recognizing that RTD is a regional service and the way the service was outlined for all intents and purposes was bringing individuals into the central business district.",
      "[6427.27-6432.94] SPEAKER_16: That level of ridership isn't there and that's not to negate that there",
      "[6433.84-6439.26] SPEAKER_16: is some elements centered on a need to move people to and fro.",
      "[6439.32-6443.05] SPEAKER_16: Hence, that's why there was the advent of the partnership program.",
      "[6443.39-6450.49] SPEAKER_16: And one of the reasons why Erie basically wanted to join the district because they were looking to put forward an application",
      "[6450.84-6476.02] SPEAKER_16: for the partnership program, and I know you're just using that as an example, but just wanted to further iterate that because for all intents and purposes, as we're looking to provide mobility options, the intent behind the partnership program was more or less like a pilot in the sense that let's see how many people are utilizing this means of connection",
      "[6476.66-6488.65] SPEAKER_16: prior to putting out a 40 foot or a 60 foot Arctic that costs more money per revenue hour and doesn't yield the same return on investment relative to the cost per boarding.",
      "[6490.25-6493.04] SPEAKER_16: Does that help or did I complicated more?",
      "[6493.08-6496.66] SPEAKER_16: Okay.",
      "[6496.68-6497.08] SPEAKER_10: Thank you.",
      "[6497.22-6499.1] SPEAKER_10: Director Guzman and then Director Geisinger.",
      "[6499.85-6503.79] SPEAKER_05: So I would urge us to cleanly pass this through tonight.",
      "[6504.19-6506.49] SPEAKER_05: I'm getting back to the motion before us.",
      "[6507.0-6519.31] SPEAKER_05: I would like to ask one question, which is the 10 to 20% is still not going to prevent us from adding services.",
      "[6520.29-6535.23] SPEAKER_05: It is simply a filter through which to look, if I understand this correctly, that we are not unintentionally harming community with protected status under the Title VI legislation,",
      "[6535.63-6542.84] SPEAKER_05: or those that might be disproportionately burdened or impacted by their financial and economic status within the region.",
      "[6543.96-6556.22] SPEAKER_05: The only purpose we need to pass this is because it is due, because it is the law, and it is how we ensure that we are able to receive our federal funding, which is approximately 25% of our total budget.",
      "[6557.4-6560.76] SPEAKER_05: So I just want to make sure I understand.",
      "[6560.98-6565.83] SPEAKER_05: what has been presented here does not tell the board no, we cannot provide transit service.",
      "[6566.61-6586.19] SPEAKER_05: It is simply a way to look at it and say we may have an issue if it reaches a certain threshold that we need to be aware of in order to be able to approve changes in service, fair changes or other changes that would create a potential burden on specific",
      "[6587.14-6590.5] SPEAKER_05: communities as defined within the Title VI language.",
      "[6590.7-6595.03] SPEAKER_05: Is that correct or am I completely lost in this conversation?",
      "[6596.85-6597.59] SPEAKER_01: Chair, are we okay for me?",
      "[6597.97-6599.03] SPEAKER_10: Absolutely, Mr. Green.",
      "[6599.05-6603.14] SPEAKER_01: If I'm tracking Director Guzman, I'll try to answer the question from what I hear.",
      "[6603.2-6605.88] SPEAKER_01: And if you have any double back, then I'll respond to it.",
      "[6606.5-6612.05] SPEAKER_01: So the current 10%, so if we think about different thresholds for DIDB,",
      "[6612.77-6641.98] SPEAKER_01: And we are in, based off the desk audit, we're in the middle tier of having a threshold that allows us as an agency, which ultimately each service equity analysis is approved by the board of directors, where it allows us, again, to your point, when we're thinking about BIPOC or Black Indigenous people of color, for disparate impact or loan communities, for disproportionate burden, it allows us to make a well-informed, eyes-wide open decision",
      "[6642.4-6646.95] SPEAKER_01: of better understanding of who's more likely to receive more of the impact.",
      "[6647.47-6656.02] SPEAKER_01: And when we're thinking about service increases, we're thinking about the fair share of benefits, where if there is a service reduction, we're looking at who's more likely to receive more of the burden.",
      "[6656.54-6666.17] SPEAKER_01: So to your point, Director Guzman, it allows us to just get a better understanding of the level of impact that we can have on a particular community.",
      "[6666.59-6669.24] SPEAKER_01: It does not prevent us from moving forward.",
      "[6671.19-6671.61] SPEAKER_01: Thank you.",
      "[6671.63-6678.95] SPEAKER_05: I would just urge a no vote and let's move on to the policy.",
      "[6679.86-6680.32] SPEAKER_10: All right.",
      "[6681.14-6685.99] SPEAKER_10: Dr. Geisinger, I'm going to have you as our final comment on this specific amendment.",
      "[6686.23-6687.39] SPEAKER_00: I'll be super quick.",
      "[6687.41-6693.64] SPEAKER_00: At that last explanation that Mr. Green gave helped me in terms of just giving us a better holistic view.",
      "[6693.66-6701.49] SPEAKER_00: But I shared Director Larson's sort of view of are we just making this harder for ourselves, creating more work?",
      "[6703.23-6704.05] SPEAKER_00: Is that not right?",
      "[6705.59-6706.53] SPEAKER_01: Mr. Green?",
      "[6706.55-6708.28] SPEAKER_01: Yeah, that's a great follow up question.",
      "[6708.3-6709.62] SPEAKER_01: I would say it",
      "[6710.85-6738.71] SPEAKER_01: I wouldn't say it's making it harder because when we think about what we're ultimately trying to achieve and a percentage that's mathematically consistent relative to the populations that we serve, so in doing this work, given my background, right, in doing an assessment of whether if we, and that's why we didn't want to make any modifications of increasing or decreasing the major service change, we just wanted to keep it consistent, is",
      "[6738.98-6750.13] SPEAKER_01: with doing this work, or even doing an analysis of previous run boards or equity analyses, 20% is something where you wouldn't see anything.",
      "[6751.39-6762.07] SPEAKER_01: And that's a disservice when we think about our populations within our service area, specifically as we look at our census data where 38.1% is BIPOC, 13.1%.",
      "[6762.65-6765.6] SPEAKER_01: or 14.1 rather for low income, right?",
      "[6765.72-6769.96] SPEAKER_01: And then if we look at the onboard survey, 56% are considered BIPOC.",
      "[6770.98-6791.8] SPEAKER_01: And so I say all that to say, just to wrap it up, is that 10% threshold for DINDB allows us to make an informed decision that is backed by not only our desk audit, but the years of experience and knowing, having a better understanding of ultimately what we're trying to achieve.",
      "[6794.35-6794.77] SPEAKER_00: Thank you.",
      "[6795.09-6795.41] SPEAKER_10: Thank you."
    ],
    "pre": [
      "[6264.97-6274.95] SPEAKER_10: Thank you director any further conversation on this amendment Secretary Nicholson So this is for our deputy general counsel"
    ],
    "post": []
  },
  {
    "start": 7208.49,
    "end": 7300.56,
    "text": [
      "[7208.49-7217.1] SPEAKER_02: So I sat through two committee meetings, a study session and a town hall all on this topic.",
      "[7217.48-7228.37] SPEAKER_02: And I should say, expertly facilitated by our co-chairs and by our chair of finance and our staff.",
      "[7228.65-7234.29] SPEAKER_02: And I feel like I just starting to get a decent understanding of it.",
      "[7234.49-7238.5] SPEAKER_02: Like I came into this knowing nothing about this.",
      "[7238.48-7258.46] SPEAKER_02: I was an absolute no when we first started and my public remarks, you know, made that very clear but I want to commend staff and our board leadership who were willing to indulge because I came to understand it.",
      "[7258.86-7270.86] SPEAKER_02: I came to understand what it was for, I came to understand how it works, and I don't necessarily agree with all of it, and I think we could use more data in addition to those data we have now to determine this, but...",
      "[7271.99-7273.99] SPEAKER_02: If we don't pass this, we lose federal funding.",
      "[7274.32-7276.48] SPEAKER_02: So there's a good reason to pass it even if you don't like it.",
      "[7278.02-7282.79] SPEAKER_02: But on top of that, I just think our staff did their jobs.",
      "[7283.29-7288.3] SPEAKER_02: They have demonstrated to me this is the right thing to do despite my skepticism.",
      "[7288.52-7290.34] SPEAKER_02: And so I'm definitely voting for it tonight.",
      "[7290.98-7291.72] SPEAKER_10: Thank you.",
      "[7291.74-7293.1] SPEAKER_10: Any further comments on the main motion?",
      "[7294.5-7295.2] SPEAKER_10: Okay, seeing none.",
      "[7295.23-7298.01] SPEAKER_10: We had Catlin as the mover and Guzman as the second.",
      "[7298.53-7300.5] SPEAKER_10: There is indication that there will be no votes."
    ],
    "pre": [
      "[7203.16-7204.15] SPEAKER_06: So I'll be in no vote.",
      "[7204.17-7205.09] SPEAKER_06: Thanks.",
      "[7205.11-7205.95] SPEAKER_06: Thank you, Director Larson.",
      "[7206.03-7206.87] SPEAKER_10: Secretary Nicholson."
    ],
    "post": []
  },
  {
    "start": 7415.77,
    "end": 7679.42,
    "text": [
      "[7415.77-7419.86] SPEAKER_02: Yeah, so I understand where we're the importance of what we're doing here.",
      "[7421.46-7430.84] SPEAKER_02: I think that these buses in particular, you know, in my religion, there's a thing why is this night different from all other nights why are these buses different from all other buses.",
      "[7432.07-7436.23] SPEAKER_02: These are going to be the flagship of our flagship BRT line.",
      "[7437.09-7443.74] SPEAKER_02: And if these suck, it will kill BRT.",
      "[7444.28-7458.56] SPEAKER_02: And if they are not comfortable, if they are not just awesome in every way possible, you can make a lot of choices when you buy a bus about how nice it's going to be in the same way you can make a lot of choices about when you buy a car about how nice it's going to be.",
      "[7459.22-7462.06] SPEAKER_02: And so I just want to lean in here",
      "[7462.04-7484.94] SPEAKER_02: and I do have one question, to say that we need to pull the stops out, we need to make sure we're giving you enough money, GMCO Johnson, to make sure we're buying top of the line, to make sure that these are things that when they run through my district, people go, wow, I want to get on that, not, wow, that doesn't look very nice.",
      "[7485.66-7492.05] SPEAKER_02: And so my question for you is, how do you know that the amount of money that we're authorizing today",
      "[7492.02-7494.13] SPEAKER_02: is enough to get top of the line.",
      "[7494.91-7505.36] SPEAKER_02: And how many bytes at the Apple are we going to get to make sure that you are buying the right buses for this incredibly important project?",
      "[7506.56-7506.75] SPEAKER_10: Ms.",
      "[7506.81-7509.49] SPEAKER_10: Johnson is 51 million enough to make them not suck.",
      "[7510.67-7511.23] SPEAKER_16: Yeah.",
      "[7512.31-7515.09] SPEAKER_16: So thank you very much, Mr. Chair.",
      "[7515.73-7517.73] SPEAKER_16: And thank you for the question.",
      "[7518.43-7519.59] SPEAKER_09: My apologies.",
      "[7519.63-7520.35] SPEAKER_16: That was a good question.",
      "[7520.57-7521.34] SPEAKER_16: Keep it in mind.",
      "[7521.36-7525.66] SPEAKER_16: This is a budget transfer and full transparency.",
      "[7526.18-7530.72] SPEAKER_16: Director Nicholson emailed me about this because I think there was some confusion about where we are.",
      "[7531.05-7532.63] SPEAKER_16: There is yet to be a solicitation.",
      "[7532.67-7534.49] SPEAKER_16: There's yet to be specifications.",
      "[7534.89-7541.67] SPEAKER_16: So these monies that are being transferred or needed",
      "[7542.08-7544.4] SPEAKER_16: for all intents and purposes so we can start a procurement.",
      "[7546.84-7549.85] SPEAKER_16: Now, keeping in mind, there's a couple of elements.",
      "[7550.19-7558.35] SPEAKER_16: These buses have to be dedicated because this is designated as a bus rapid transit project as defined by the Federal Transit Administration.",
      "[7558.81-7564.4] SPEAKER_16: There's certain criteria that we have to ensure that we adhere to.",
      "[7564.46-7571.61] SPEAKER_16: This will be a dedicated fleet just by virtue of the configuration of BRT with it being a center running platform.",
      "[7572.1-7583.03] SPEAKER_16: So when you talk about it being top of the line, that's yet to be seen in reference to what we have before us because there's only two original equipment manufacturers in the United States.",
      "[7583.09-7584.64] SPEAKER_16: There's only so many suppliers.",
      "[7585.0-7593.55] SPEAKER_16: There are certain seeds and there is a national task force in which I sit where we're talking about doing away with customization because that increases prices.",
      "[7593.8-7597.84] SPEAKER_16: I bet you don't know how many shades of white there is with new flier industries.",
      "[7598.14-7598.32] SPEAKER_16: 24.",
      "[7598.62-7599.68] SPEAKER_16: How many?",
      "[7599.7-7600.28] SPEAKER_16: 24.",
      "[7600.31-7601.19] SPEAKER_16: 23.",
      "[7601.45-7602.93] SPEAKER_16: I think I told you that earlier.",
      "[7603.01-7613.12] SPEAKER_16: So the point of the matter is, as we talk about this, right, we're going to do our due diligence and we're going to ensure it's a competitive solicitation.",
      "[7613.16-7620.53] SPEAKER_16: And we do understand the aspects because that's what separates bus rapid transit from general thick route service.",
      "[7621.43-7621.85] SPEAKER_16: Thank you.",
      "[7622.48-7624.93] SPEAKER_02: Secretary, I really appreciate it.",
      "[7625.01-7629.69] SPEAKER_02: And I look forward to you coming back often to update us on how the purchase is going.",
      "[7632.1-7632.6] SPEAKER_13: Yes.",
      "[7632.62-7643.59] SPEAKER_05: Uh, director Griswold, just really quickly, uh, with regards to this, moving this money from the unrestricted fund is simply to begin the procurement process.",
      "[7644.11-7647.9] SPEAKER_05: And although it's not part of the 2025 budget, we do need to get started on it.",
      "[7648.5-7649.2] SPEAKER_05: Um, however,",
      "[7649.45-7656.6] SPEAKER_05: I would suggest that as we go forward, these buses are meant to be purchased in finality by 2027 to begin this service.",
      "[7657.24-7668.75] SPEAKER_05: And that is work that we will do to fully do on finance and planning to ensure that it is included in all necessary documents that come before this board for approval.",
      "[7669.23-7672.46] SPEAKER_05: And I am certain that our new CFO is up to the task on that.",
      "[7672.58-7678.89] SPEAKER_05: So rest assured, directors, we're not wantonly spending money, but we do need to authorize"
    ],
    "pre": [
      "[7411.95-7413.43] SPEAKER_03: Any further conversation?",
      "[7413.47-7414.45] SPEAKER_03: Secretary Nicholson?"
    ],
    "post": []
  },
  {
    "start": 8675.43,
    "end": 9085.59,
    "text": [
      "[8675.43-8678.14] SPEAKER_02: I actually have some questions for Ms.",
      "[8678.66-8678.98] SPEAKER_02: Brady.",
      "[8679.62-8684.39] SPEAKER_02: So first off, Director Pagliari raised the concern about the term deep affordability.",
      "[8685.01-8689.61] SPEAKER_02: I think you and I know what that means, but maybe the rest of the board doesn't, given it's a term of art.",
      "[8689.67-8693.36] SPEAKER_02: Can you elaborate on what that's referring to?",
      "[8694.1-8694.26] SPEAKER_02: Ms.",
      "[8694.3-8694.54] SPEAKER_02: Brady.",
      "[8694.98-8695.28] SPEAKER_18: Sure.",
      "[8695.34-8695.52] SPEAKER_18: Yes.",
      "[8695.82-8703.89] SPEAKER_18: Deep affordability is a term in the affordable housing network that means generally 30 to 40% of AMI.",
      "[8704.31-8709.43] SPEAKER_18: It is squishy, I think still, but generally it's understood to mean 30 to 40%.",
      "[8709.49-8711.64] SPEAKER_02: Secretary.",
      "[8712.07-8719.36] SPEAKER_02: So second question, I've heard a couple of concerns about 75% as a discount.",
      "[8721.04-8734.54] SPEAKER_02: I was hoping maybe you could speak to like, because I mentioned it a little bit, but as someone who's an expert in the space, and I will say you and I worked pretty closely together on this language and went back and forth, you did a meeting with me.",
      "[8734.62-8737.02] SPEAKER_02: So this isn't just something that I wrote myself.",
      "[8737.1-8741.47] SPEAKER_02: This is something that got vetted pretty heavily by staff.",
      "[8742.4-8758.02] SPEAKER_02: What impact does a greater discount have on the types of projects that in the affordable housing space you tend to see people able to build?",
      "[8758.08-8762.24] SPEAKER_02: At least from where I sit, the reason for doing this is that",
      "[8762.22-8771.86] SPEAKER_02: When it comes to those deeply affordable, which are deeply subsidized units, when it comes to things like units that are fully accessible, those are expensive.",
      "[8772.12-8778.55] SPEAKER_02: They cost developers money, which is why when you don't have those subsidies, those units don't get built.",
      "[8778.61-8782.26] SPEAKER_02: I think it's about half the projects that are in the CHFA database.",
      "[8782.24-8790.49] SPEAKER_02: have zero units at 30% AMI and very few of them have anything with regard to accessibility.",
      "[8790.51-8796.56] SPEAKER_02: So I'm hoping you can maybe elaborate on, you know, you're the one who would be using this tool at the end of the day.",
      "[8796.6-8801.25] SPEAKER_02: How do you see it coming in handy with regard to what you're able to do?",
      "[8801.87-8803.33] SPEAKER_02: And then I've won the last follow up.",
      "[8805.15-8805.49] SPEAKER_09: It's pretty.",
      "[8809.16-8809.46] SPEAKER_02: You're not.",
      "[8813.18-8820.07] SPEAKER_18: Thank you.",
      "[8820.79-8824.78] SPEAKER_18: So affordable housing projects aren't notoriously difficult to finance.",
      "[8825.48-8836.13] SPEAKER_18: And I mean, I think if you use the example earlier of tapestry and Denver health, Denver health, as you stated is correct donated the land for tapestry.",
      "[8836.17-8840.24] SPEAKER_18: I can assure you that that development was still very difficult to finance.",
      "[8841.08-8841.34] SPEAKER_18: So",
      "[8841.57-8851.04] SPEAKER_18: even if the land we were giving the land at 100% discount, the projects would still not pencil in many cases.",
      "[8851.56-8869.89] SPEAKER_18: And so our ability to discount the land to 75% as the board prefers just in many cases could get us over the hump from a project not being built to a project being built and to that project having more affordable units as opposed to",
      "[8870.1-8873.65] SPEAKER_18: a higher, more of a middle income range.",
      "[8874.31-8876.75] SPEAKER_18: And that's the difference that the land discount makes.",
      "[8877.11-8887.7] SPEAKER_18: And that's the certainty that this policy helps me bring to conversations with developers is, gets them in the mindset of we're going to get some help here from RTD.",
      "[8888.48-8891.11] SPEAKER_18: We can focus on deeper affordability units.",
      "[8891.13-8898.48] SPEAKER_18: We can make bigger promises to Chaffa or other financing entities to host in Denver.",
      "[8898.88-8900.84] SPEAKER_18: It helps us keep the projects moving.",
      "[8901.42-8909.05] SPEAKER_18: Um, but, and I'd be frank with you, this is, as I said, tapestry, even with a hundred percent discount, it's still hard to do.",
      "[8909.23-8910.57] SPEAKER_18: This is not a silver bullet.",
      "[8911.17-8917.14] SPEAKER_18: Um, but it, it moves the needle and it helps us actually, you know, keep projects afloat and get to the finish line.",
      "[8917.56-8918.0] SPEAKER_10: Thank you, Ms.",
      "[8918.02-8918.36] SPEAKER_10: Brady.",
      "[8918.6-8921.96] SPEAKER_10: We're going to wrap up with director O'Keith and then director Larson.",
      "[8922.46-8924.14] SPEAKER_21: Oh, I thought I got last word.",
      "[8924.85-8927.85] SPEAKER_21: So, I support this amendment.",
      "[8927.99-8939.16] SPEAKER_21: I think it is a reasonable step toward developing communities that are very likely to use our services.",
      "[8939.3-8943.53] SPEAKER_21: And I think increasing ridership is something",
      "[8943.51-8944.61] SPEAKER_21: we all agree on.",
      "[8944.65-8946.92] SPEAKER_21: This is a concrete way to do that.",
      "[8948.02-8958.05] SPEAKER_21: It also takes land not just for our benefit in ridership, but also puts improvements on it that helps the tax base.",
      "[8958.47-8972.35] SPEAKER_21: And I think the communities that we serve would rather see a housing project end up on that property where it becomes improved.",
      "[8972.33-8973.82] SPEAKER_21: versus somewhere else.",
      "[8973.83-8975.14] SPEAKER_21: We're not the only game in town.",
      "[8975.18-8976.78] SPEAKER_21: There's a lot of discounts out there.",
      "[8977.52-8983.5] SPEAKER_21: And so we're not necessarily in a tight buyers market.",
      "[8983.65-8985.91] SPEAKER_21: There's a lot of projects that can go forward.",
      "[8986.59-8994.8] SPEAKER_21: And I think we need to put our best deal, at least give Chessie and the rest of the team the tools to bring the deal forward.",
      "[8995.76-8997.28] SPEAKER_21: I do want to put one plug in.",
      "[8997.32-8998.18] SPEAKER_21: We talked about it.",
      "[8998.48-9000.7] SPEAKER_21: I don't think round leases",
      "[9000.68-9003.39] SPEAKER_21: are the best tool in Colorado.",
      "[9003.43-9006.79] SPEAKER_21: First of all, it's not as common as other places in the world.",
      "[9007.43-9015.64] SPEAKER_21: And the other thing is toward the end of your ground lease, no matter how long you make it, the property will fall into disrepair.",
      "[9015.94-9021.41] SPEAKER_21: They are not going to put money into physical facilities that are going to roll off their books.",
      "[9021.39-9029.08] SPEAKER_21: So, for that reason, I like the discount is great and I love a sale versus a ground lease.",
      "[9029.1-9031.38] SPEAKER_21: And I know you'll keep that in mind as we go forward.",
      "[9032.08-9039.88] SPEAKER_21: And anyway, that's another argument in favor of that tactic.",
      "[9039.9-9040.46] SPEAKER_06: Director Bill Arson.",
      "[9042.4-9042.86] SPEAKER_06: Thank you.",
      "[9043.1-9046.49] SPEAKER_06: I'm going to be a no vote on this.",
      "[9046.94-9050.76] SPEAKER_06: I don't agree with our transit oriented development policy as it is right now.",
      "[9050.98-9057.75] SPEAKER_06: I don't agree with the goal of trying to provide affordable housing or encourage it, incentivize it.",
      "[9058.13-9062.2] SPEAKER_06: I think we should be focused on trying to increase ridership.",
      "[9062.22-9071.95] SPEAKER_06: If we want to provide discounts on our land, we should provide them with the goal in mind of increasing the number of people that can live",
      "[9072.33-9077.22] SPEAKER_06: on the property, whatever is developed, and the amount of traffic that is on the property.",
      "[9078.38-9080.82] SPEAKER_06: So I'm a no on this.",
      "[9081.5-9082.4] SPEAKER_06: Thank you, Director Larson.",
      "[9082.55-9082.84] SPEAKER_10: All right.",
      "[9083.26-9085.25] SPEAKER_10: The indication there is a no vote."
    ],
    "pre": [
      "[8670.22-8670.94] SPEAKER_18: Okay, yes.",
      "[8673.42-8674.31] SPEAKER_10: Secretary Nicholson."
    ],
    "post": []
  },
  {
    "start": 9476.34,
    "end": 9930.61,
    "text": [
      "[9476.34-9477.14] SPEAKER_02: Secretary Nicholson.",
      "[9478.22-9481.39] SPEAKER_02: I'd like to offer an amendment, if that's all right.",
      "[9482.99-9483.57] SPEAKER_10: To the amendment.",
      "[9483.75-9484.17] SPEAKER_02: Thank you.",
      "[9485.4-9486.8] SPEAKER_10: Just to clarify, that was a question.",
      "[9486.92-9488.62] SPEAKER_10: You would like to offer an amendment to the amendment?",
      "[9488.98-9489.14] SPEAKER_02: Yes.",
      "[9490.67-9491.33] SPEAKER_02: Let's have an amendment.",
      "[9491.54-9492.99] SPEAKER_07: Mr. Krull.",
      "[9493.0-9521.38] SPEAKER_07: Technically the initial motion on the table is to amend the ETOD policy and this is an amendment to that amendment and at this point you would be amending an amendment to an amendment which is not allowed under Robert's rules so you would need to tackle this amendment as it's being presented and then if you feel so inclined offer an amendment to whatever state the",
      "[9521.36-9547.44] SPEAKER_02: uh policy is in at that point rock on uh secretary yeah so at that point i would say i'd have to be a no been for the very simple reason um where it says no project will be eligible we're talking about an uh equitable tod policy here um which is specifically focused on using our land to facilitate like the literally the policy is about giving discounts um i can't see",
      "[9547.42-9570.44] SPEAKER_02: putting something like this in there unless it is related to said discount so I'd be fine if it said additionally no project receiving a discount will be eligible for any discounts etc unless it complies with but I don't necessarily think it makes sense to do market rate policy in an etod policy thank you secretary i have treasurer banker and then director isha",
      "[9570.64-9571.96] SPEAKER_19: It's just real quick.",
      "[9572.0-9585.2] SPEAKER_19: Have you perhaps considered something more positive saying something like along the lines greater consideration would be given a project if these items were attained as opposed to make it mandatory?",
      "[9588.18-9589.79] SPEAKER_10: Dr. Risha or Dr. Kisman?",
      "[9589.81-9592.19] SPEAKER_19: Again, sort of an amendment, but just a thought.",
      "[9592.97-9593.11] SPEAKER_17: Thanks.",
      "[9593.13-9597.44] SPEAKER_17: So I just want to address what Secretary Nicholson said.",
      "[9597.86-9605.89] SPEAKER_17: I might have missed part of the closed captioning, but I think you said you don't think we should be applying accessibility minimums to market rate.",
      "[9606.83-9607.05] SPEAKER_17: Okay.",
      "[9607.39-9607.99] SPEAKER_17: That's exact.",
      "[9608.19-9608.51] SPEAKER_17: We don't.",
      "[9608.83-9609.69] SPEAKER_17: So this amendment doesn't do that.",
      "[9610.09-9623.23] SPEAKER_17: And the second piece, um, the reason why I didn't say it doesn't reference discounts is because, uh, so this goes at the end of the policy, which is all, like the way it's nested under the paragraph, the discount, this is talking about when discounts apply, if that makes sense.",
      "[9623.61-9624.39] SPEAKER_17: So it's just,",
      "[9625.9-9629.17] SPEAKER_17: It does what you said you wanted it to do.",
      "[9629.19-9630.13] SPEAKER_17: It's just late.",
      "[9630.67-9631.19] SPEAKER_02: On Nicholson.",
      "[9631.41-9631.75] SPEAKER_02: Thank you.",
      "[9632.17-9636.36] SPEAKER_02: And then the, I guess the only question I have for, and this is actually for Ms.",
      "[9636.4-9637.9] SPEAKER_02: Brady, if that's okay.",
      "[9638.4-9650.14] SPEAKER_02: Under what, because you mentioned that Denver has a policy that supersede or that matches this and the state currently is considering a policy that would supersede it, but currently does not.",
      "[9650.67-9654.66] SPEAKER_02: Under what circumstances would this have any effect at all?",
      "[9654.84-9662.93] SPEAKER_02: Like in what circumstances can you imagine in your professional capacity, do you see this being something that would matter?",
      "[9664.03-9664.19] SPEAKER_09: Ms.",
      "[9664.23-9664.51] SPEAKER_09: Brady?",
      "[9665.28-9669.68] SPEAKER_18: Yes, in a jurisdiction that doesn't currently require accessible units.",
      "[9669.84-9675.07] SPEAKER_18: And Director Rush has mentioned some, I'm not aware of them, but this is not my area of expertise.",
      "[9675.09-9680.06] SPEAKER_18: So, but in a jurisdiction that does not already have those requirements that is not",
      "[9680.26-9693.94] SPEAKER_18: accepting HUD money, and if Colorado Department of Housing changes their rules, does not accept Department of Housing money, then that project would then be subject to this policy requirement.",
      "[9695.82-9696.24] SPEAKER_10: Thank you, Ms.",
      "[9696.28-9696.56] SPEAKER_10: Breedy.",
      "[9696.88-9697.7] SPEAKER_10: Secretary, quickly.",
      "[9698.54-9710.18] SPEAKER_02: Yeah, just, I guess, for Director Rusher, Director Guzman, are there any jurisdictions in the RTD service area that don't have that same requirement that Denver does?",
      "[9712.1-9712.9] SPEAKER_10: either directors?",
      "[9714.3-9718.99] SPEAKER_17: Yeah, I think I'm pretty smart, but I'm not qualified to talk about 53 separate jurisdictions.",
      "[9719.05-9727.38] SPEAKER_17: So I'm just going to have to lean into this is E TOD and the E is equitable.",
      "[9727.9-9733.29] SPEAKER_17: We spend a lot of time talking about equity today, including spending a significant amount of time talking about people with disabilities.",
      "[9733.81-9739.54] SPEAKER_17: And so just again, recognizing that the HUD requirement",
      "[9742.61-9758.49] SPEAKER_17: is about equity and not excluding people on the basis of disability from accessing affordable housing because the FH Fair Housing Act, the ADA, and other areas of anti-discrimination law, including state law, don't effectively",
      "[9759.0-9760.38] SPEAKER_17: covered that aspect.",
      "[9761.6-9763.04] SPEAKER_17: Sorry, that was more than what you asked.",
      "[9763.06-9765.12] SPEAKER_17: But no, I can't answer your question.",
      "[9766.87-9777.08] SPEAKER_17: Just like you probably couldn't answer my question about every single jurisdiction in the RTD region that has something regarding parking minimums.",
      "[9778.02-9779.13] SPEAKER_17: It's a broad concept.",
      "[9780.53-9781.29] SPEAKER_10: Thank you, Director Usha.",
      "[9781.73-9783.77] SPEAKER_10: Any further conversation on this amendment?",
      "[9784.92-9785.64] SPEAKER_05: Dr. Guzman.",
      "[9785.66-9787.4] SPEAKER_05: I will offer this last thing.",
      "[9787.73-9801.91] SPEAKER_05: and then we probably should go to a vote, but very simply put, we need to make sure that we are protecting the vulnerable, providing access to these housing units.",
      "[9802.19-9805.48] SPEAKER_05: Even in the city and county of Denver's building codes is not clear.",
      "[9805.54-9806.84] SPEAKER_05: It's as clear as mud.",
      "[9807.14-9813.33] SPEAKER_05: There is reference to this if certain dollars are used, but stacking in the way that developers work, it's not necessarily required.",
      "[9813.37-9822.16] SPEAKER_05: We aspire to a certain ICAA rule, but it's not clear if that means that they have to do this or not in order to get licensed.",
      "[9822.84-9835.41] SPEAKER_05: And so to be fair to ourselves and to ensure that we are taking care of the ADA community and providing those accessible units, I would like to see this in the policy.",
      "[9835.59-9848.38] SPEAKER_05: I would be fine, by the way, to adjust language on this to say we would consider giving additional discount, but I don't want any project to go forward that doesn't meet a bare minimum requirement that's established.",
      "[9848.42-9860.66] SPEAKER_05: And although it is established in other places, it is not established in our policy, and we are the government of this region, and we should take it seriously that we have a due diligence and responsibility to those members of our community that would need this.",
      "[9860.88-9863.12] SPEAKER_05: Thank you.",
      "[9864.68-9870.37] SPEAKER_04: I always have to follow you, Director Guzman, but obviously I'm very in support.",
      "[9870.63-9881.67] SPEAKER_04: Any time that we can be supportive of our communities most in need, those suffering from a whole variety of disabilities, I want to be able to put our best foot forward there.",
      "[9882.11-9886.54] SPEAKER_04: And while we can't call specific jurisdictions, if there is that",
      "[9886.52-9893.5] SPEAKER_04: chance that there is a jurisdiction that isn't meeting this requirement, then we should make sure we're getting there.",
      "[9893.56-9899.09] SPEAKER_04: And if in the process the state comes up with something better or something in the future, that's okay.",
      "[9899.45-9906.5] SPEAKER_04: But I think that this is a safety net in my mind about how to really get there for this community.",
      "[9908.73-9925.16] SPEAKER_04: I think that also, as we're tying these developments, spur off around our transit, that's also giving them better access to the resources and giving them the life that they want and the freedom of movement that we so cherish.",
      "[9925.22-9927.24] SPEAKER_04: So I'm highly in support of this.",
      "[9927.22-9927.56] SPEAKER_10: Thank you.",
      "[9928.04-9929.3] SPEAKER_04: Secretary, less than 30 seconds."
    ],
    "pre": [
      "[9471.26-9472.87] SPEAKER_11: It seems a little bit redundant."
    ],
    "post": [
      "[9930.61-9934.17] SPEAKER_02: This question is for Chessie.",
      "[9934.41-9942.3] SPEAKER_02: My understanding with this language is that it applies to buildings with elevators in it.",
      "[9942.42-9956.98] SPEAKER_02: And so with single stair buildings, that there are different policies around equitable access because of the challenges, obviously, in a single stair building of getting people into the second, the third, the fourth, the fifth floor.",
      "[9957.28-9960.69] SPEAKER_02: You're probably the biggest expert on this in the room."
    ]
  },
  {
    "start": 9930.61,
    "end": 10001.36,
    "text": [
      "[9930.61-9934.17] SPEAKER_02: This question is for Chessie.",
      "[9934.41-9942.3] SPEAKER_02: My understanding with this language is that it applies to buildings with elevators in it.",
      "[9942.42-9956.98] SPEAKER_02: And so with single stair buildings, that there are different policies around equitable access because of the challenges, obviously, in a single stair building of getting people into the second, the third, the fourth, the fifth floor.",
      "[9957.28-9960.69] SPEAKER_02: You're probably the biggest expert on this in the room.",
      "[9961.87-9973.16] SPEAKER_02: Do you see any concerns with this language when it comes to buildings with stairs only versus elevators?",
      "[9973.86-9983.58] SPEAKER_18: I am not the biggest expert on this in the room, but I would say that equitable, I do know that equitable access and accessible units are different things and have different requirements.",
      "[9984.4-9987.89] SPEAKER_18: And so we're talking specifically about accessible units.",
      "[9989.21-9995.48] SPEAKER_18: We're also not, we're tending to be talking about larger buildings because we do want them to be dense at stations.",
      "[9995.5-10000.18] SPEAKER_18: So I think they're typically going to be elevator buildings, but I don't have any concerns about that.",
      "[10000.2-10000.58] SPEAKER_10: Thank you, Ms.",
      "[10000.6-10000.86] SPEAKER_10: Brady."
    ],
    "pre": [
      "[9925.22-9927.24] SPEAKER_04: So I'm highly in support of this.",
      "[9927.22-9927.56] SPEAKER_10: Thank you.",
      "[9928.04-9929.3] SPEAKER_04: Secretary, less than 30 seconds."
    ],
    "post": []
  },
  {
    "start": 10162.36,
    "end": 10259.07,
    "text": [
      "[10162.36-10168.81] SPEAKER_02: I just wanted to flag that this weekend is the reopening of downtown celebration on Saturday and Sunday.",
      "[10168.91-10176.8] SPEAKER_02: So if you like RTD, please come take it to downtown and enjoy our lovely food and all the other cool stuff.",
      "[10176.94-10180.58] SPEAKER_02: Most of them all is back and running and we're very excited about it.",
      "[10181.48-10182.08] SPEAKER_10: Any other matters?",
      "[10183.22-10184.1] SPEAKER_10: Okay, I got a quick one.",
      "[10184.12-10186.53] SPEAKER_10: It's only going to take 19 minutes.",
      "[10188.35-10188.91] SPEAKER_10: Just joking.",
      "[10189.29-10193.66] SPEAKER_10: My only other matter is please make sure that you, uh, directors fill out that form.",
      "[10194.06-10197.52] SPEAKER_10: Um, that was due last week extended to Monday morning.",
      "[10197.66-10201.15] SPEAKER_10: Please make sure you guys take care of that with that, the survey.",
      "[10201.21-10201.57] SPEAKER_10: Thank you.",
      "[10201.91-10204.84] SPEAKER_10: With that being said, uh, do I have a motion to adjourn?",
      "[10205.74-10206.44] SPEAKER_10: Director Russia.",
      "[10206.82-10207.26] SPEAKER_10: Second.",
      "[10207.28-10208.28] SPEAKER_10: And a second from Goodgerner.",
      "[10208.34-10209.75] SPEAKER_10: You guys all have a lovely night.",
      "[10209.93-10211.35] SPEAKER_10: Thank you all for your patience.",
      "[10228.61-10229.07] SPEAKER: Bye."
    ],
    "pre": [
      "[10152.53-10157.71] SPEAKER_05: And I was grateful for the assistance from staff and from Director Ruscha to be able to host that town hall.",
      "[10157.73-10157.93] SPEAKER_05: Thanks.",
      "[10159.43-10161.38] SPEAKER_10: Thank you, Director Guzman.",
      "[10161.4-10162.18] SPEAKER_10: Secretary Nicholson."
    ],
    "post": []
  }
]
